[
  {
    "text": "Who wrote the letter of 1 Timothy?",
    "options": ["Timothy", "Titus", "Paul", "Luke"],
    "correctAnswerIndex": 2,
    "book": "1 Timothy",
    "difficulty": "Easy",
    "verseReference": "1 Timothy 1:1",
    "verseText": "Paul, an apostle of Christ Jesus by command of God our Savior and of Christ Jesus our hope,"
  },
  {
    "text": "To whom is the letter of 1 Timothy addressed?",
    "options": ["The church in Ephesus", "Titus", "Timothy, Paul's 'true child in the faith'", "The church in Rome"],
    "correctAnswerIndex": 2,
    "book": "1 Timothy",
    "difficulty": "Easy",
    "verseReference": "1 Timothy 1:2",
    "verseText": "To Timothy, my true child in the faith: Grace, mercy, and peace from God the Father and Christ Jesus our Lord."
  },
  {
    "text": "1 Timothy, 2 Timothy, and Titus are often grouped together and called what?",
    "options": ["The General Epistles", "The Prison Epistles", "The Pastoral Epistles", "The Catholic Epistles"],
    "correctAnswerIndex": 2,
    "book": "1 Timothy",
    "difficulty": "Medium",
    "verseReference": "N/A (Classification)",
    "verseText": "(These letters are called the Pastoral Epistles because they provide instruction from Paul to his younger associates (Timothy and Titus) regarding pastoral leadership and church order)."
  },
  {
    "text": "What was one main reason Paul urged Timothy to remain in Ephesus (1 Timothy 1)?",
    "options": ["To start a new church", "To charge certain persons not to teach different doctrines", "To organize a collection", "To escape persecution"],
    "correctAnswerIndex": 1,
    "book": "1 Timothy",
    "difficulty": "Medium",
    "verseReference": "1 Timothy 1:3",
    "verseText": "As I urged you when I was going to Macedonia, remain at Ephesus so that you may charge certain persons not to teach any different doctrine,"
  },
  {
    "text": "1 Timothy 2 gives instructions regarding what aspect of church life?",
    "options": ["Spiritual gifts", "The Lord's Supper", "Public prayer and the conduct of men and women in worship", "Church discipline"],
    "correctAnswerIndex": 2,
    "book": "1 Timothy",
    "difficulty": "Medium",
    "verseReference": "1 Timothy 2:1, 8, 9",
    "verseText": "First of all, then, I urge that supplications, prayers, intercessions, and thanksgivings be made for all people... I desire then that in every place the men should pray, lifting holy hands without anger or quarreling; likewise also that women should adorn themselves in respectable apparel..."
  },
  {
    "text": "What offices of church leadership does Paul provide qualifications for in 1 Timothy 3?",
    "options": ["Apostles and Prophets", "Evangelists and Teachers", "Overseers (Bishops/Elders) and Deacons", "Pastors and Musicians"],
    "correctAnswerIndex": 2,
    "book": "1 Timothy",
    "difficulty": "Easy",
    "verseReference": "1 Timothy 3:1, 8",
    "verseText": "The saying is trustworthy: If anyone aspires to the office of overseer, he desires a noble task... Deacons likewise must be dignified..."
  },
  {
    "text": "According to 1 Timothy 3:2, an overseer must be...",
    "options": ["Wealthy and influential", "A recent convert", "Above reproach, the husband of one wife, sober-minded, self-controlled, respectable, hospitable, able to teach", "Unmarried and devoted only to the church"],
    "correctAnswerIndex": 2,
    "book": "1 Timothy",
    "difficulty": "Medium",
    "verseReference": "1 Timothy 3:2",
    "verseText": "Therefore an overseer must be above reproach, the husband of one wife, sober-minded, self-controlled, respectable, hospitable, able to teach,"
  },
  {
    "text": "In 1 Timothy 4, Paul warns against false teachers who forbid what and require abstinence from foods?",
    "options": ["Prayer", "Marriage", "Work", "Giving"],
    "correctAnswerIndex": 1,
    "book": "1 Timothy",
    "difficulty": "Medium",
    "verseReference": "1 Timothy 4:1, 3",
    "verseText": "Now the Spirit expressly says that in later times some will depart from the faith by devoting themselves to deceitful spirits and teachings of demons... who forbid marriage and require abstinence from foods that God created to be received with thanksgiving..."
  },
  {
    "text": "What does Paul instruct Timothy regarding the treatment of different groups within the church, such as older men, younger men, older women, and younger women (1 Timothy 5)?",
    "options": ["Treat them all the same", "Rebuke them harshly", "Treat them with respect as family members (fathers, brothers, mothers, sisters)", "Avoid interacting with them"],
    "correctAnswerIndex": 2,
    "book": "1 Timothy",
    "difficulty": "Medium",
    "verseReference": "1 Timothy 5:1-2",
    "verseText": "Do not rebuke an older man but encourage him as you would a father, younger men as brothers, older women as mothers, younger women as sisters, in all purity."
  },
  {
    "text": "What does Paul call the 'root of all kinds of evil' in 1 Timothy 6?",
    "options": ["Pride", "Power", "The love of money", "Idolatry"],
    "correctAnswerIndex": 2,
    "book": "1 Timothy",
    "difficulty": "Easy",
    "verseReference": "1 Timothy 6:10",
    "verseText": "For the love of money is a root of all kinds of evils. It is through this craving that some have wandered away from the faith and pierced themselves with many pangs."
  }
]
