[
  {
    "text": "Which king oversaw the construction of the temple described in 2 Chronicles 2?",
    "options": ["Solomon", "David", "Rehoboam", "Hezekiah"],
    "correctAnswerIndex": 0,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 2:1",
    "verseText": "Now Solomon purposed to build a house for the name of the LORD and a royal palace for himself."
  },
  {
    "text": "From which king did Solomon request cedar, cypress, and gold for the temple construction?",
    "options": ["Hiram of Tyre", "Nebuchadnezzar", "Pharaoh", "Ahab"],
    "correctAnswerIndex": 0,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 2:3",
    "verseText": "And Solomon sent word to Hiram the king of Tyre, 'As you dealt with David my father and sent him cedar to build himself a house to dwell in, so deal with me.'"
  },
  {
    "text": "What appeared to Solomon at Gibeon in a dream?",
    "options": ["An Angel", "The LORD", "His father David", "A Cherub"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 1:7",
    "verseText": "In that night God appeared to Solomon and said to him, 'Ask what I shall give you.'"
  },
  {
    "text": "What did Solomon ask God for instead of riches or long life?",
    "options": ["Military power", "Fame", "Wisdom and knowledge", "Vengeance on enemies"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 1:10",
    "verseText": "Give me now wisdom and knowledge that I may go out and come in before this people, for who can govern this people of yours, which is so great?"
  },
  {
    "text": "How many years did it take Solomon to build the Temple?",
    "options": ["3 years", "7 years", "10 years", "20 years"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "1 Kings 6:38",
    "verseText": "and in the eleventh year, in the month of Bul, which is the eighth month, the house was finished in all its parts, and according to all its specifications. He was seven years in building it."
  },
  {
    "text": "What filled the Temple when the priests came out of the Holy Place during the dedication?",
    "options": ["Smoke", "Water", "A cloud representing the glory of the LORD", "A strong wind"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 5:13-14",
    "verseText": "and it was the duty of the trumpeters and singers to make themselves heard in unison in praise and thanksgiving to the LORD), and when the song was raised, with trumpets and cymbals and other musical instruments, in praise to the LORD, 'For he is good, for his steadfast love endures forever,' the house, the house of the LORD, was filled with a cloud, so that the priests could not stand to minister because of the cloud, for the glory of the LORD filled the house of God."
  },
  {
    "text": "Which queen visited Solomon to test his wisdom?",
    "options": ["Queen Esther", "Queen Jezebel", "The Queen of Sheba", "Queen Vashti"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 9:1",
    "verseText": "Now when the queen of Sheba heard of the fame of Solomon, she came to Jerusalem to test him with hard questions, having a very great retinue and camels bearing spices and very much gold and precious stones. And when she came to Solomon, she told him all that was on her mind."
  },
  {
    "text": "Who succeeded Solomon as king?",
    "options": ["Jeroboam", "Rehoboam", "Abijah", "Asa"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 9:31",
    "verseText": "And Solomon slept with his fathers and was buried in the city of David his father, and Rehoboam his son reigned in his place."
  },
  {
    "text": "Which king caused the kingdom to divide by rejecting the counsel of the older men?",
    "options": ["Solomon", "David", "Rehoboam", "Asa"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 10:13-14",
    "verseText": "And the king answered them harshly, and forsaking the counsel of the old men, King Rehoboam spoke to them according to the counsel of the young men, saying, 'My father made your yoke heavy, but I will add to it. My father disciplined you with whips, but I will discipline you with scorpions.'"
  },
  {
    "text": "Which king of Judah reigned for 41 years and generally did what was right in the eyes of the LORD?",
    "options": ["Rehoboam", "Abijah", "Asa", "Jehoshaphat"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 14:2, 16:13",
    "verseText": "And Asa did what was good and right in the eyes of the LORD his God. Asa reigned forty-one years in Jerusalem."
  },
  {
    "text": "Which king of Judah made an alliance with Ahab, king of Israel?",
    "options": ["Asa", "Jehoshaphat", "Joram", "Ahaziah"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 18:1",
    "verseText": "Now Jehoshaphat had great riches and honor, and he made a marriage alliance with Ahab."
  },
  {
    "text": "Which prophet rebuked King Jehoshaphat for helping the wicked King Ahab?",
    "options": ["Elijah", "Elisha", "Jehu son of Hanani", "Isaiah"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 19:2",
    "verseText": "But Jehu the son of Hanani the seer went out to meet him and said to King Jehoshaphat, 'Should you help the wicked and love those who hate the LORD? Because of this, wrath has gone out against you from the LORD.'"
  },
  {
    "text": "When faced with a vast army, what was King Jehoshaphat's first response?",
    "options": ["Prepare for battle", "Flee the city", "Seek the LORD and proclaim a fast", "Send spies"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 20:3",
    "verseText": "Then Jehoshaphat was afraid and set his face to seek the LORD, and proclaimed a fast throughout all Judah."
  },
  {
    "text": "Who usurped the throne of Judah after King Ahaziah's death by killing the royal offspring?",
    "options": ["Jehoram", "Jezebel", "Athaliah", "Joash"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 22:10",
    "verseText": "Now when Athaliah the mother of Ahaziah saw that her son was dead, she arose and destroyed all the royal family of the house of Judah."
  },
  {
    "text": "Which young king was hidden in the Temple for six years?",
    "options": ["Ahaziah", "Joash (Jehoash)", "Amaziah", "Uzziah"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 22:12",
    "verseText": "And he was with them hidden in the house of God for six years, while Athaliah reigned over the land."
  },
  {
    "text": "Which priest led the coup against Athaliah and restored Joash to the throne?",
    "options": ["Zadok", "Abiathar", "Jehoiada", "Hilkiah"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 23:1",
    "verseText": "But in the seventh year Jehoiada took courage and entered into a covenant with the commanders of hundreds, Azariah the son of Jeroham, Ishmael the son of Jehohanan, Azariah the son of Obed, Maaseiah the son of Adaiah, and Elishaphat the son of Zichri."
  },
  {
    "text": "King Joash repaired which important building?",
    "options": ["The city walls", "His palace", "The Temple of the LORD", "The royal stables"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 24:4",
    "verseText": "After this Joash decided to restore the house of the LORD."
  },
  {
    "text": "Which king was struck with leprosy for unlawfully burning incense in the Temple?",
    "options": ["Joash", "Amaziah", "Uzziah (Azariah)", "Jotham"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 26:19-20",
    "verseText": "Then Uzziah was angry. Now he had a censer in his hand to burn incense, and when he became angry with the priests, leprosy broke out on his forehead in the presence of the priests in the house of the LORD, by the altar of incense. And Azariah the chief priest and all the priests looked at him, and behold, he was leprous in his forehead! And they rushed him out quickly, and he himself hurried to go out, because the LORD had struck him."
  },
  {
    "text": "Which king of Judah famously reopened and cleansed the Temple after his father Ahaz had closed it?",
    "options": ["Jotham", "Manasseh", "Hezekiah", "Josiah"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 29:3",
    "verseText": "In the first year of his reign, in the first month, he opened the doors of the house of the LORD and repaired them."
  },
  {
    "text": "King Hezekiah reinstituted the celebration of which major festival?",
    "options": ["Feast of Tabernacles", "Passover", "Pentecost", "Day of Atonement"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 30:1",
    "verseText": "Hezekiah sent to all Israel and Judah, and wrote letters also to Ephraim and Manasseh, that they should come to the house of the LORD at Jerusalem to keep the Passover to the LORD, the God of Israel."
  },
  {
    "text": "Which Assyrian king besieged Jerusalem during Hezekiah's reign?",
    "options": ["Tiglath-Pileser III", "Shalmaneser V", "Sargon II", "Sennacherib"],
    "correctAnswerIndex": 3,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 32:1",
    "verseText": "After these things and these acts of faithfulness, Sennacherib king of Assyria came and invaded Judah and besieged the fortified cities, thinking to win them for himself."
  },
  {
    "text": "How was Sennacherib's army defeated outside Jerusalem?",
    "options": ["By Hezekiah's army", "By a plague sent by an angel of the LORD", "By starvation", "By internal rebellion"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 32:21",
    "verseText": "And the LORD sent an angel, who cut off all the mighty warriors and commanders and officers in the camp of the king of Assyria. So he returned with shame of face to his own land. And when he came into the house of his god, some of his own sons struck him down there with the sword."
  },
  {
    "text": "Which king had the longest reign in Judah (55 years) and was known for his extreme wickedness, though he later repented?",
    "options": ["Hezekiah", "Manasseh", "Amon", "Josiah"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 33:1, 12-13",
    "verseText": "Manasseh was twelve years old when he began to reign, and he reigned fifty-five years in Jerusalem. And when he was in distress, he entreated the favor of the LORD his God and humbled himself greatly before the God of his fathers. He prayed to him, and God was moved by his entreaty and heard his plea and brought him again to Jerusalem into his kingdom. Then Manasseh knew that the LORD was God."
  },
  {
    "text": "Which righteous king began seeking God at age 16 and started major reforms, including the destruction of idols?",
    "options": ["Hezekiah", "Manasseh", "Amon", "Josiah"],
    "correctAnswerIndex": 3,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 34:3",
    "verseText": "For in the eighth year of his reign, while he was yet a boy, he began to seek the God of David his father, and in the twelfth year he began to purge Judah and Jerusalem of the high places, the Asherim, and the carved and the metal images."
  },
  {
    "text": "What important item was found in the Temple during Josiah's repairs?",
    "options": ["The Ark of the Covenant", "The Book of the Law", "Aaron's rod", "A pot of manna"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 34:14",
    "verseText": "While they were bringing out the money that had been brought into the house of the LORD, Hilkiah the priest found the Book of the Law of the LORD given through Moses."
  },
  {
    "text": "How did the righteous King Josiah die?",
    "options": ["Old age", "Illness", "In battle against Pharaoh Neco", "Assassination"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 35:23-24",
    "verseText": "And the archers shot King Josiah. And the king said to his servants, 'Take me away, for I am badly wounded.' So his servants took him out of the chariot and carried him in his second chariot and brought him to Jerusalem. And he died and was buried in the tombs of his fathers. All Judah and Jerusalem mourned for Josiah."
  },
  {
    "text": "Which Babylonian king conquered Jerusalem and carried the people of Judah into exile?",
    "options": ["Sennacherib", "Pharaoh Neco", "Nebuchadnezzar", "Cyrus"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 36:17",
    "verseText": "Therefore he brought up against them the king of the Chaldeans, who killed their young men with the sword in the house of their sanctuary and had no compassion on young man or virgin, old man or aged. He gave them all into his hand."
  },
  {
    "text": "What happened to the Temple vessels during the Babylonian exile?",
    "options": ["They were hidden", "They were destroyed", "They were taken to Babylon", "They were melted down"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 36:18",
    "verseText": "And all the vessels of the house of God, great and small, and the treasures of the house of the LORD and the treasures of the king's house, all these he brought to Babylon."
  },
  {
    "text": "Which Persian king issued a decree allowing the Jews to return and rebuild the Temple?",
    "options": ["Darius", "Xerxes (Ahasuerus)", "Artaxerxes", "Cyrus"],
    "correctAnswerIndex": 3,
    "book": "2 Chronicles",
    "difficulty": "Easy",
    "verseReference": "2 Chronicles 36:22-23",
    "verseText": "Now in the first year of Cyrus king of Persia, that the word of the LORD by the mouth of Jeremiah might be fulfilled, the LORD stirred up the spirit of Cyrus king of Persia, so that he made a proclamation throughout all his kingdom and also put it in writing: 'Thus says Cyrus king of Persia, The LORD, the God of heaven, has given me all the kingdoms of the earth, and he has charged me to build him a house at Jerusalem, which is in Judah. Whoever is among you of all his people, may the LORD his God be with him. Let him go up.'"
  },
  {
    "text": "What specific types of skilled workers did Solomon request from Hiram?",
    "options": ["Farmers and shepherds", "Soldiers and guards", "Craftsmen in gold, silver, bronze, iron, purple, crimson, and blue fabrics, and engravers", "Scribes and administrators"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 2:7",
    "verseText": "So now send me a man skilled to work in gold, silver, bronze, and iron, and in purple, crimson, and blue fabrics, trained also in engraving, to be with the skilled workers who are with me in Judah and Jerusalem, whom David my father provided."
  },
  {
    "text": "What were the names of the two large bronze pillars placed at the entrance of the Temple?",
    "options": ["Boaz and Jachin", "Alpha and Omega", "David and Solomon", "Mercy and Judgment"],
    "correctAnswerIndex": 0,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 3:17",
    "verseText": "He set up the pillars in front of the temple, one on the south, the other on the north; that on the south he called Jachin, and that on the north Boaz."
  },
  {
    "text": "How many lampstands of gold did Solomon place inside the nave of the Temple?",
    "options": ["One", "Two", "Seven", "Ten"],
    "correctAnswerIndex": 3,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 4:7",
    "verseText": "And he made ten golden lampstands according to the specifications for them, and set them in the temple, five on the south side and five on the north."
  },
  {
    "text": "In Solomon's prayer of dedication, he asked God to hear prayers offered towards the Temple even from what group of people?",
    "options": ["Only Levites", "Only the king", "Foreigners", "Only residents of Jerusalem"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 6:32",
    "verseText": "'Likewise, when a foreigner, who is not of your people Israel, comes from a far country for your great name's sake and your mighty hand and your outstretched arm, when he comes and prays toward this house,'"
  },
  {
    "text": "What consumed the burnt offering and sacrifices when Solomon finished praying at the Temple dedication?",
    "options": ["Water from heaven", "Locusts", "Fire from heaven", "An earthquake"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 7:1",
    "verseText": "As soon as Solomon finished his prayer, fire came down from heaven and consumed the burnt offering and the sacrifices, and the glory of the LORD filled the temple."
  },
  {
    "text": "What condition did God give Solomon for establishing his throne forever in 2 Chronicles 7?",
    "options": ["Conquering more nations", "Building more palaces", "Walking before God faithfully and obeying His commands", "Accumulating more wealth"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 7:17-18",
    "verseText": "'And as for you, if you will walk before me as David your father walked, doing according to all that I have commanded you and keeping my statutes and my rules, then I will establish your royal throne, as I covenanted with David your father, saying, You shall not lack a man to rule Israel.'"
  },
  {
    "text": "Where did Solomon build a fleet of ships, assisted by Hiram's servants?",
    "options": ["Mediterranean Sea", "Sea of Galilee", "Ezion-geber near Eloth on the shore of the Red Sea", "The Nile River"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 8:17",
    "verseText": "Then Solomon went to Ezion-geber and Eloth on the shore of the sea, in the land of Edom."
  },
  {
    "text": "How much gold did the Queen of Sheba give Solomon?",
    "options": ["1 talent", "10 talents", "120 talents", "1000 talents"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 9:9",
    "verseText": "Then she gave the king 120 talents of gold, and a very great quantity of spices, and precious stones."
  },
  {
    "text": "Which Egyptian king plundered the Temple and royal palace during Rehoboam's reign?",
    "options": ["Pharaoh Neco", "Pharaoh Hophra", "Shishak", "Thutmose"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 12:9",
    "verseText": "So Shishak king of Egypt came up against Jerusalem. He took away the treasures of the house of the LORD and the treasures of the king's house. He took away everything. He also took away the shields of gold that Solomon had made."
  },
  {
    "text": "Which prophet warned Rehoboam about the impending attack by Shishak due to Judah's unfaithfulness?",
    "options": ["Shemaiah", "Ahijah", "Iddo", "Oded"],
    "correctAnswerIndex": 0,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 12:5",
    "verseText": "Then Shemaiah the prophet came to Rehoboam and to the princes of Judah, who had gathered at Jerusalem because of Shishak, and said to them, 'Thus says the LORD, You abandoned me, so I have abandoned you to the hand of Shishak.'"
  },
  {
    "text": "King Abijah of Judah won a major victory against which king of Israel?",
    "options": ["Ahab", "Omri", "Jeroboam", "Baasha"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 13:19-20",
    "verseText": "And Abijah pursued Jeroboam and took cities from him, Bethel with its villages and Jeshanah with its villages and Ephron with its villages. Jeroboam did not recover his power in the days of Abijah. And the LORD struck him down, and he died."
  },
  {
    "text": "King Asa faced a massive army led by which Cushite commander?",
    "options": ["Sennacherib", "Nebuchadnezzar", "Zerah", "Hadadezer"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 14:9",
    "verseText": "Zerah the Ethiopian came out against them with an army of a million men and 300 chariots, and came as far as Mareshah."
  },
  {
    "text": "Which prophet encouraged Asa to continue his reforms after the victory over the Cushites?",
    "options": ["Hanani", "Azariah son of Oded", "Jehu son of Hanani", "Micah"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 15:1, 8",
    "verseText": "The Spirit of God came upon Azariah the son of Oded. When Asa heard these words, the prophecy of Azariah the son of Oded, he took courage and put away the detestable idols from all the land of Judah and Benjamin and from the cities that he had taken in the hill country of Ephraim, and he repaired the altar of the LORD that was in front of the vestibule of the house of the LORD."
  },
  {
    "text": "Why was the seer Hanani imprisoned by King Asa?",
    "options": ["For prophesying defeat", "For rebuking Asa for relying on the king of Syria instead of God", "For conspiring against the king", "For demanding higher taxes"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 16:7, 10",
    "verseText": "At that time Hanani the seer came to Asa king of Judah and said to him, 'Because you relied on the king of Syria, and did not rely on the LORD your God, the army of the king of Syria has escaped you.' Then Asa was angry with the seer and put him in the stocks, for he was in a rage with him because of this. And Asa inflicted cruelties upon some of the people at the same time."
  },
  {
    "text": "What educational initiative did King Jehoshaphat implement throughout Judah?",
    "options": ["Building libraries", "Sending princes and Levites to teach the Book of the Law", "Establishing philosophical schools", "Translating foreign texts"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 17:7-9",
    "verseText": "In the third year of his reign he sent his officials, Ben-hail, Obadiah, Zechariah, Nethanel, and Micaiah, to teach in the cities of Judah; and with them the Levites, Shemaiah, Nethaniah, Zebadiah, Asahel, Shemiramoth, Jehonathan, Adonijah, Tobijah, and Tobadonijah; and with these Levites, the priests Elishama and Jehoram. And they taught in Judah, having the Book of the Law of the LORD with them. They went about through all the cities of Judah and taught among the people."
  },
  {
    "text": "Which prophet predicted King Ahab's death in the battle at Ramoth-gilead, despite 400 other prophets predicting victory?",
    "options": ["Elijah", "Jehu son of Hanani", "Micaiah son of Imlah", "Isaiah"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 18:16, 7",
    "verseText": "And Micaiah said, 'As the LORD lives, what my God says, that I will speak.' And the king of Israel said to Jehoshaphat, 'There is yet one man by whom we may inquire of the LORD, Micaiah the son of Imlah; but I hate him, for he never prophesies good concerning me, but always evil.'"
  },
  {
    "text": "How did the LORD defeat the armies of Ammon, Moab, and Mount Seir when they came against Jehoshaphat?",
    "options": ["A great earthquake", "They turned on each other and destroyed themselves", "A flood", "Disease"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 20:22-23",
    "verseText": "And when they began to sing and praise, the LORD set an ambush against the men of Ammon, Moab, and Mount Seir, who had come against Judah, so that they were routed. For the men of Ammon and Moab rose against the inhabitants of Mount Seir, devoting them to destruction, and when they had made an end of the inhabitants of Seir, they all helped to destroy one another."
  },
  {
    "text": "What gruesome end did King Jehoram of Judah (Jehoshaphat's son) suffer due to his wickedness?",
    "options": ["Killed in battle", "Assassinated by servants", "Struck by lightning", "His bowels came out due to a disease"],
    "correctAnswerIndex": 3,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 21:18-19",
    "verseText": "And after all this the LORD struck him in his bowels with an incurable disease. In the course of time, at the end of two years, his bowels came out because of the disease, and he died in great agony. His people made no fire in his honor, like the fires made for his fathers."
  },
  {
    "text": "Which relative advised the wicked King Ahaziah of Judah?",
    "options": ["His father Jehoram", "His mother Athaliah", "His uncle Ahab", "His grandfather Jehoshaphat"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 22:3",
    "verseText": "He also walked in the ways of the house of Ahab, for his mother was his counselor in doing wickedly."
  },
  {
    "text": "Who killed King Ahaziah of Judah while purging the house of Ahab in Israel?",
    "options": ["Athaliah", "Jehu", "Hazael of Syria", "His own servants"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 22:8-9",
    "verseText": "When Jehu was executing judgment on the house of Ahab, he met the princes of Judah and the sons of Ahaziah's brothers, who attended Ahaziah, and he killed them. He searched for Ahaziah, and he was captured while hiding in Samaria, and he was brought to Jehu and put to death. They buried him, for they said, 'He is the grandson of Jehoshaphat, who sought the LORD with all his heart.' And the house of Ahaziah had no one able to rule the kingdom."
  },
  {
    "text": "King Joash turned away from God after the death of which influential figure?",
    "options": ["His mother Zibiah", "The prophet Zechariah", "The priest Jehoiada", "His son Amaziah"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 24:17",
    "verseText": "Now after the death of Jehoiada the princes of Judah came and paid homage to the king. Then the king listened to them."
  },
  {
    "text": "Which prophet, the son of Jehoiada the priest, did King Joash have stoned to death in the Temple court?",
    "options": ["Isaiah", "Jeremiah", "Zechariah", "Hosea"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 24:20-21",
    "verseText": "Then the Spirit of God clothed Zechariah the son of Jehoiada the priest, and he stood above the people, and said to them, 'Thus says God, Why do you break the commandments of the LORD, so that you cannot prosper? Because you have forsaken the LORD, he has forsaken you.' But they conspired against him, and by command of the king they stoned him with stones in the court of the house of the LORD."
  },
  {
    "text": "King Amaziah hired soldiers from which nation, only to send them back at a prophet's warning?",
    "options": ["Egypt", "Syria (Aram)", "Israel (Ephraim)", "Edom"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 25:6-7",
    "verseText": "He hired also 100,000 mighty men of valor from Israel for 100 talents of silver. But a man of God came to him and said, 'O king, do not let the army of Israel go with you, for the LORD is not with Israel, with all these Ephraimites.'"
  },
  {
    "text": "After defeating the Edomites, what foolish thing did King Amaziah do?",
    "options": ["Made an alliance with Syria", "Attacked Egypt", "Brought back the gods of Edom and worshipped them", "Disbanded his army"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 25:14",
    "verseText": "After Amaziah came from striking down the Edomites, he brought the gods of the men of Seir and set them up as his gods and bowed down before them and burned incense to them."
  },
  {
    "text": "Which king of Israel defeated and captured King Amaziah of Judah?",
    "options": ["Jeroboam II", "Jehu", "Jehoash (Joash)", "Pekah"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 25:21-23",
    "verseText": "So Joash king of Israel went up, and he and Amaziah king of Judah faced one another in battle at Beth-shemesh, which belongs to Judah. And Judah was defeated by Israel, and every man fled to his home. And Joash king of Israel captured Amaziah king of Judah, the son of Joash, son of Ahaziah, at Beth-shemesh, and brought him to Jerusalem and broke down the wall of Jerusalem for 400 cubits, from the Ephraim Gate to the Corner Gate."
  },
  {
    "text": "King Uzziah became famous for strengthening Jerusalem and developing what?",
    "options": ["A large navy", "International trade routes", "Agriculture and military inventions", "A school of prophets"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 26:9-10, 15",
    "verseText": "Moreover, Uzziah built towers in Jerusalem at the Corner Gate and at the Valley Gate and at the Angle, and fortified them. And he built towers in the wilderness and dug many cisterns, for he had large herds, both in the Shephelah and in the plain, and he had farmers and vinedressers in the hills and in the fertile lands, for he loved the soil. And he made in Jerusalem engines, invented by skillful men, to be on the towers and the corners, to shoot arrows and great stones. And his fame spread far, for he was marvelously helped, till he was strong."
  },
  {
    "text": "Which king of Judah was contemporary with the prophets Isaiah and Micah?",
    "options": ["Amaziah", "Uzziah", "Jotham", "Ahaz"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "Isaiah 1:1, Micah 1:1",
    "verseText": "The vision of Isaiah the son of Amoz, which he saw concerning Judah and Jerusalem in the days of Uzziah, Jotham, Ahaz, and Hezekiah, kings of Judah. The word of the LORD that came to Micah of Moresheth in the days of Jotham, Ahaz, and Hezekiah, kings of Judah, which he saw concerning Samaria and Jerusalem."
  },
  {
    "text": "King Ahaz practiced extreme idolatry, including sacrificing his own sons in which valley?",
    "options": ["Valley of Jezreel", "Kidron Valley", "Valley of Hinnom", "Valley of Elah"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 28:3",
    "verseText": "and he made offerings in the Valley of the Son of Hinnom and burned his sons as an offering, according to the abominations of the nations whom the LORD drove out before the people of Israel."
  },
  {
    "text": "Which prophet intervened when Israel (Ephraim) took many captives from Judah during Ahaz's reign, causing them to be returned?",
    "options": ["Isaiah", "Oded", "Micah", "Hosea"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 28:9",
    "verseText": "But a prophet of the LORD was there, whose name was Oded, and he went out to meet the army that came to Samaria and said to them, 'Behold, because the LORD, the God of your fathers, was angry with Judah, he gave them into your hand, but you have killed them in a rage that has reached up to heaven.'"
  },
  {
    "text": "What did King Ahaz do to the Temple of the LORD before his death?",
    "options": ["Renovated it lavishly", "Expanded it", "Shut its doors and made altars in every corner of Jerusalem", "Installed idols from Egypt"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 28:24",
    "verseText": "And Ahaz gathered together the vessels of the house of God and cut in pieces the vessels of the house of God, and he shut up the doors of the house of the LORD, and he made himself altars in every corner of Jerusalem."
  },
  {
    "text": "During Hezekiah's Passover celebration, many attendees were ritually unclean. How was this addressed?",
    "options": ["They were sent away", "The celebration was postponed", "Hezekiah prayed for God to pardon them", "They performed extra sacrifices"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 30:18-20",
    "verseText": "For a majority of the people, many of them from Ephraim, Manasseh, Issachar, and Zebulun, had not cleansed themselves, yet they ate the Passover otherwise than as prescribed. For Hezekiah had prayed for them, saying, 'May the good LORD pardon everyone who sets his heart to seek God, the LORD, the God of his fathers, even though not according to the sanctuary's rules of cleanness.' And the LORD heard Hezekiah and healed the people."
  },
  {
    "text": "What engineering feat did Hezekiah accomplish to secure Jerusalem's water supply against the Assyrians?",
    "options": ["Built aqueducts from afar", "Dug massive wells inside the city", "Constructed a tunnel from the Gihon Spring into the city", "Created large rainwater reservoirs"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 32:3-4, 30",
    "verseText": "he planned with his officers and his mighty men to stop the water of the springs that were outside the city. And they helped him. A great many people were gathered, and they stopped all the springs and the brook that flowed through the land, saying, 'Why should the kings of Assyria come and find much water?' This same Hezekiah closed the upper outlet of the waters of Gihon and directed them down to the west side of the city of David. And Hezekiah prospered in all his works."
  },
  {
    "text": "Why did envoys from Babylon come to Hezekiah?",
    "options": ["To form a military alliance", "To offer tribute", "To inquire about the miraculous sign (sun's shadow moving back) that had happened", "To demand submission"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 32:31",
    "verseText": "And so in the matter of the envoys of the princes of Babylon, who had been sent to him to inquire about the sign that had been done in the land, God left him to himself, in order to test him and to know all that was in his heart."
  },
  {
    "text": "Where was King Manasseh taken captive by the Assyrians?",
    "options": ["Nineveh", "Damascus", "Egypt", "Babylon"],
    "correctAnswerIndex": 3,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 33:11",
    "verseText": "Therefore the LORD brought upon them the commanders of the army of the king of Assyria, who captured Manasseh with hooks and bound him with chains of bronze and brought him to Babylon."
  },
  {
    "text": "After his repentance, what did Manasseh do upon returning to Jerusalem?",
    "options": ["Abdicated the throne", "Built more pagan altars", "Removed foreign gods, restored the LORD's altar, and commanded Judah to serve God", "Focused only on military strength"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 33:15-16",
    "verseText": "And he took away the foreign gods and the idol from the house of the LORD, and all the altars that he had built on the mountain of the house of the LORD and in Jerusalem, and he threw them outside of the city. He also restored the altar of the LORD and offered on it sacrifices of peace offerings and of thanksgiving, and commanded Judah to serve the LORD, the God of Israel."
  },
  {
    "text": "How long did King Amon, Manasseh's wicked son, reign before being assassinated?",
    "options": ["6 months", "1 year", "2 years", "5 years"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 33:21",
    "verseText": "Amon was twenty-two years old when he began to reign, and he reigned two years in Jerusalem."
  },
  {
    "text": "Besides Hilkiah the priest, who was the scribe who read the discovered Book of the Law to King Josiah?",
    "options": ["Baruch", "Gemariah", "Shaphan", "Elishama"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 34:15, 18",
    "verseText": "Then Hilkiah answered and said to Shaphan the secretary, 'I have found the Book of the Law in the house of the LORD.' And Hilkiah gave the book to Shaphan. Then Shaphan the secretary told the king, 'Hilkiah the priest has given me a book.' And Shaphan read from it before the king."
  },
  {
    "text": "Which prophetess did Josiah's officials consult after the Book of the Law was found?",
    "options": ["Deborah", "Miriam", "Huldah", "Anna"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 34:22",
    "verseText": "So Hilkiah and those whom the king had sent went to Huldah the prophetess, the wife of Shallum the son of Tokhath, son of Hasrah, keeper of the wardrobe (now she lived in Jerusalem in the Second Quarter) and spoke to her to that effect."
  },
  {
    "text": "King Josiah's Passover celebration was noted for its scale and adherence to the Law, surpassing any Passover since the time of which judge/prophet?",
    "options": ["Gideon", "Samson", "Samuel", "Eli"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 35:18",
    "verseText": "No Passover like it had been kept in Israel since the days of Samuel the prophet."
  },
  {
    "text": "Why was Pharaoh Neco traveling through Judah when he confronted Josiah at Megiddo?",
    "options": ["To conquer Judah", "To aid the king of Assyria against Babylon at Carchemish", "To trade with Tyre", "To establish a garrison"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Medium",
    "verseReference": "2 Chronicles 35:20-21",
    "verseText": "After all this, when Josiah had prepared the temple, Neco king of Egypt went up to fight at Carchemish on the Euphrates, and Josiah went out to meet him. But Neco sent messengers to him, saying, 'What have we to do with each other, king of Judah? I am not coming against you this day, but against the house with which I am at war. And God has commanded me to hurry. Cease opposing God, who is with me, lest he destroy you.'"
  },
  {
    "text": "What specific wood, besides cedar and cypress, did Solomon request from Hiram, known for its use in musical instruments and stairs?",
    "options": ["Oak", "Algum (or Almug)", "Ebony", "Teak"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 2:8",
    "verseText": "Send me also cedar, cypress, and algum timber from Lebanon, for I know that your servants know how to cut timber in Lebanon. And my servants will be with your servants,"
  },
  {
    "text": "How many chief officers did Solomon appoint to oversee the work on the Temple?",
    "options": ["150", "550", "3,600", "30,000"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 2:18",
    "verseText": "He assigned 70,000 of them to bear burdens and 80,000 to quarry in the hill country, and 3,600 to oversee them."
  },
  {
    "text": "The dimensions of the Most Holy Place (Holy of Holies) in Solomon's Temple were described as a perfect cube of what size?",
    "options": ["10 cubits x 10 cubits x 10 cubits", "20 cubits x 20 cubits x 20 cubits", "30 cubits x 30 cubits x 30 cubits", "40 cubits x 40 cubits x 40 cubits"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 3:8",
    "verseText": "He made the Most Holy Place. Its length, corresponding to the breadth of the house, was twenty cubits, and its breadth was twenty cubits. He overlaid it with fine gold amounting to 600 talents."
  },
  {
    "text": "What was the combined weight of gold used to overlay the Most Holy Place?",
    "options": ["100 talents", "300 talents", "600 talents", "1000 talents"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 3:8",
    "verseText": "He overlaid it with fine gold amounting to 600 talents."
  },
  {
    "text": "How many bronze lavers (basins) were made for the Temple priests to wash the offerings, in addition to the large 'Sea'?",
    "options": ["One", "Five", "Ten", "Twelve"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 4:6",
    "verseText": "He also made ten basins in which to wash, and set five on the south side, and five on the north side. In these they were to rinse the parts of the burnt offering, but the sea was for the priests to wash in."
  },
  {
    "text": "How many kors of wheat and kors of pressed oil did Solomon give Hiram annually for his workers?",
    "options": ["10,000 each", "20,000 each", "50,000 each", "100,000 each"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 2:10",
    "verseText": "I will give for your servants, the woodsmen who cut timber, 20,000 cors of crushed wheat, 20,000 cors of barley, 20,000 baths of wine, and 20,000 baths of oil."
  },
  {
    "text": "Which specific fortified cities did Rehoboam build up in Judah and Benjamin after the kingdom split?",
    "options": ["Jericho, Ai, Bethel", "Bethlehem, Etam, Tekoa, Beth-zur, Soco, Adullam, Gath, Mareshah, Ziph, Adoraim, Lachish, Azekah, Zorah, Aijalon, Hebron", "Megiddo, Hazor, Gezer", "Samaria, Tirzah, Shechem"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 11:5-10",
    "verseText": "Rehoboam lived in Jerusalem and built fortified cities in Judah. He built Bethlehem, Etam, Tekoa, Beth-zur, Soco, Adullam, Gath, Mareshah, Ziph, Adoraim, Lachish, Azekah, Zorah, Aijalon, and Hebron, fortified cities that are in Judah and in Benjamin."
  },
  {
    "text": "From which specific tribes did priests and Levites migrate to Judah because Jeroboam had excluded them from serving the LORD in Israel?",
    "options": ["Only Levi", "Levi and Benjamin", "From all the tribes of Israel", "Judah and Simeon"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 11:13-14, 16",
    "verseText": "And the priests and the Levites who were in all Israel presented themselves to him from all their territories. For the Levites left their common lands and their holdings and came to Judah and Jerusalem, because Jeroboam and his sons cast them out from serving as priests of the LORD, And those who had set their hearts to seek the LORD God of Israel came after them from all the tribes of Israel to Jerusalem to sacrifice to the LORD, the God of their fathers."
  },
  {
    "text": "During the battle between Abijah and Jeroboam, how many chosen men comprised Abijah's army from Judah?",
    "options": ["100,000", "200,000", "400,000", "800,000"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 13:3",
    "verseText": "Abijah went out to battle having an army of valiant men of war, 400,000 chosen men. And Jeroboam drew up his line of battle against him with 800,000 chosen men, mighty men of valor."
  },
  {
    "text": "King Asa removed his own grandmother, Maacah, from being queen mother because she had made what?",
    "options": ["A treaty with Egypt", "An abominable image for Asherah", "A golden calf", "A competing temple"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 15:16",
    "verseText": "Even Maacah, his mother, King Asa removed from being queen mother because she had made an abominable image for Asherah. Asa cut down her image, crushed it, and burned it at the brook Kidron."
  },
  {
    "text": "What specific disease afflicted King Asa in his old age, for which he sought physicians rather than the LORD?",
    "options": ["Leprosy", "Boils", "A severe disease in his feet", "Blindness"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 16:12",
    "verseText": "In the thirty-ninth year of his reign Asa was diseased in his feet, and his disease became severe. Yet even in his disease he did not seek the LORD, but sought help from physicians."
  },
  {
    "text": "Who was the commander of King Jehoshaphat's army, leading 300,000 mighty men of valor?",
    "options": ["Jehoiada", "Adnah", "Amasiah", "Eliada"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 17:14",
    "verseText": "This was the muster of them by fathers' houses: Of Judah, the commanders of thousands: Adnah the commander, with 300,000 mighty men of valor..."
  },
  {
    "text": "What did the singers whom Jehoshaphat appointed chant as they went out before the army against Moab and Ammon?",
    "options": ["The LORD is my shepherd", "'Give thanks to the LORD, for his steadfast love endures forever'", "The LORD reigns", "A Mighty Fortress Is Our God"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 20:21",
    "verseText": "And when he had taken counsel with the people, he appointed those who were to sing to the LORD and praise him in holy attire, as they went before the army, and say, 'Give thanks to the LORD, for his steadfast love endures forever.'"
  },
  {
    "text": "Which Edomite city revolted against Jehoram's rule over Judah?",
    "options": ["Petra", "Bozrah", "Libnah", "Teman"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 21:10",
    "verseText": "So Edom revolted from the rule of Judah to this day. At that time Libnah also revolted from his rule, because he had forsaken the LORD, the God of his fathers."
  },
  {
    "text": "Elijah sent a letter to King Jehoram predicting his gruesome death. What makes this unusual in the context of Elijah's ministry?",
    "options": ["Elijah usually delivered prophecies orally", "Elijah primarily ministered in the Northern Kingdom (Israel), not Judah", "The letter was written after Elijah was taken to heaven", "Both A and B"],
    "correctAnswerIndex": 3,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 21:12",
    "verseText": "And a letter came to him from Elijah the prophet, saying, 'Thus says the LORD, the God of David your father, Because you have not walked in the ways of Jehoshaphat your father, or in the ways of Asa king of Judah,'"
  },
  {
    "text": "During Jehoiada's restoration of Joash, specific groups were armed and stationed around the temple. Besides the Levites and guards, which other group from the people was involved?",
    "options": ["Foreign mercenaries", "The king's personal cavalry", "The 'people of the land' who entered the house of Baal", "Elders from Bethlehem"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 23:17",
    "verseText": "Then all the people went to the house of Baal and tore it down; his altars and his images they broke in pieces, and they killed Mattan the priest of Baal before the altars."
  },
  {
    "text": "After Jehoiada's death, who specifically persuaded King Joash to abandon the house of the LORD and serve Asherim and idols?",
    "options": ["His wives", "Officials/princes of Judah", "Merchants from Tyre", "Prophets of Baal"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 24:17-18",
    "verseText": "Now after the death of Jehoiada the officials of Judah came and paid homage to the king. Then the king listened to them. And they abandoned the house of the LORD, the God of their fathers, and served the Asherim and the idols. And wrath came upon Judah and Jerusalem for this guilt of theirs."
  },
  {
    "text": "How did King Joash die?",
    "options": ["In battle against Syria", "From disease", "Assassinated by his own servants in his bed", "Fell from a tower"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 24:25",
    "verseText": "When they had departed from him, leaving him severely wounded, his own servants conspired against him because of the blood of the son of Jehoiada the priest, and killed him on his bed. So he died; and they buried him in the city of David, but they did not bury him in the tombs of the kings."
  },
  {
    "text": "King Amaziah challenged Jehoash, king of Israel, using a fable involving what two plants?",
    "options": ["An olive tree and a fig tree", "A vine and a bramble", "A cedar and a thistle", "A mustard seed and a weed"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 25:18",
    "verseText": "And Joash the king of Israel sent word to Amaziah king of Judah, 'A thistle on Lebanon sent to a cedar on Lebanon, saying, Give your daughter to my son for a wife, and a wild beast of Lebanon passed by and trampled down the thistle.'"
  },
  {
    "text": "How many priests physically confronted King Uzziah when he entered the Temple to burn incense?",
    "options": ["10", "40", "81 (Azariah and 80 brave priests)", "150"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 26:17-18",
    "verseText": "But Azariah the priest went in after him, and with him eighty priests of the LORD who were men of valor. And they withstood King Uzziah and said to him, 'It is not for you, Uzziah, to burn incense to the LORD, but for the priests, the sons of Aaron, who are consecrated to burn incense. Go out of the sanctuary, for you have done wrong, and it will bring you no honor from the LORD God.'"
  },
  {
    "text": "King Jotham defeated the Ammonites and received tribute from them for how many consecutive years?",
    "options": ["One year", "Two years", "Three years", "Five years"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 27:5",
    "verseText": "He fought with the king of the Ammonites and prevailed against them. And the Ammonites gave him in that year 100 talents of silver, and 10,000 cors of wheat and 10,000 of barley. This they paid him in the second and third years also."
  },
  {
    "text": "Which two specific kings allied against Ahaz, leading him to appeal to Assyria for help?",
    "options": ["King of Moab and King of Ammon", "Rezin king of Syria and Pekah king of Israel", "King of Egypt and King of Edom", "King of Babylon and King of Elam"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 28:5-6",
    "verseText": "Therefore the LORD his God gave him into the hand of the king of Syria, who defeated him and took captive a great number of his people and brought them to Damascus. He was also given into the hand of the king of Israel, who struck him with great force. For Pekah the son of Remaliah killed 120,000 from Judah in one day, all of them men of valor, because they had forsaken the LORD, the God of their fathers."
  },
  {
    "text": "How long did the Levites take to cleanse the Temple court and the Temple itself during Hezekiah's reforms?",
    "options": ["3 days", "7 days", "16 days (8 days for court, 8 days for temple)", "30 days"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 29:17",
    "verseText": "They began to consecrate on the first day of the first month, and on the eighth day of the month they came to the vestibule of the LORD. Then for eight days they consecrated the house of the LORD, and on the sixteenth day of the first month they finished."
  },
  {
    "text": "Hezekiah's display of treasures to the Babylonian envoys is mentioned as a test from God. Which prophet explicitly rebuked him for this action (detailed more in Isaiah/2 Kings)?",
    "options": ["Micah", "Huldah", "Isaiah", "Jeremiah"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "Isaiah 39:1-8",
    "verseText": "At that time Merodach-baladan the son of Baladan, king of Babylon, sent envoys with letters and a present to Hezekiah, for he heard that he had been sick and had recovered... Then Isaiah the prophet came to King Hezekiah, and said to him, 'What did these men say? And from where did they come to you?' Hezekiah said, 'They have come from a far country, from Babylon.' He said, 'What have they seen in your house?' Hezekiah answered, 'They have seen all that is in my house. There is nothing in my storehouses that I did not show them.' Then Isaiah said to Hezekiah, 'Hear the word of the LORD of hosts: Behold, the days are coming, when all that is in your house, and that which your fathers have stored up till this day, shall be carried to Babylon. Nothing shall be left, says the LORD. And some of your own sons, who will come from you, whom you will father, shall be taken away, and they shall be eunuchs in the palace of the king of Babylon.' Then Hezekiah said to Isaiah, 'The word of the LORD that you have spoken is good.' For he thought, 'There will be peace and security in my days.'"
  },
  {
    "text": "Where specifically was King Manasseh buried, indicating a lack of full royal honors despite his repentance?",
    "options": ["In the tomb of the kings", "In his own house/garden", "On Mount Zion", "In Babylon"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 33:20",
    "verseText": "So Manasseh slept with his fathers, and they buried him in his own house. And Amon his son reigned in his place."
  },
  {
    "text": "What was the specific reaction of King Josiah when he heard the words of the Book of the Law?",
    "options": ["He rejoiced", "He questioned its authenticity", "He tore his clothes", "He immediately offered sacrifice"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 34:19",
    "verseText": "When the king heard the words of the Law, he tore his clothes."
  },
  {
    "text": "What reason did Pharaoh Neco give Josiah for demanding passage, claiming divine direction?",
    "options": ["He had a dream", "His astrologers advised it", "'God is with me, commanding me to hurry'", "He was pursuing fugitives"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 35:21",
    "verseText": "But Neco sent messengers to him, saying, 'What have we to do with each other, king of Judah? I am not coming against you this day, but against the house with which I am at war. And God has commanded me to hurry. Cease opposing God, who is with me, lest he destroy you.'"
  },
  {
    "text": "Which prophet lamented for King Josiah after his death?",
    "options": ["Isaiah", "Huldah", "Zephaniah", "Jeremiah"],
    "correctAnswerIndex": 3,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 35:25",
    "verseText": "Jeremiah also uttered a lament for Josiah. And all the singing men and singing women have spoken of Josiah in their laments to this day."
  },
  {
    "text": "How long did Jehoahaz (Shallum), Josiah's successor, reign before being deposed by Pharaoh Neco?",
    "options": ["One month", "Three months", "Six months", "One year"],
    "correctAnswerIndex": 1,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 36:2",
    "verseText": "Jehoahaz was twenty-three years old when he began to reign, and he reigned three months in Jerusalem."
  },
  {
    "text": "How long did the land enjoy its Sabbaths during the Babylonian exile, fulfilling a prophecy?",
    "options": ["40 years", "50 years", "70 years", "100 years"],
    "correctAnswerIndex": 2,
    "book": "2 Chronicles",
    "difficulty": "Hard",
    "verseReference": "2 Chronicles 36:21",
    "verseText": "...to fulfill the word of the LORD by the mouth of Jeremiah, until the land had enjoyed its Sabbaths. All the days that it lay desolate it kept Sabbath, to fulfill seventy years."
  }
]