[
  {
    "text": "Who identifies himself as the author of 2 Peter?",
    "options": ["Paul", "John", "Simeon Peter", "James"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Easy",
    "verseReference": "2 Peter 1:1",
    "verseText": "Simeon Peter, a servant and apostle of Jesus Christ, To those who have obtained a faith of equal standing with ours by the righteousness of our God and Savior Jesus Christ:"
  },
  {
    "text": "A primary purpose of 2 Peter is to warn against what?",
    "options": ["Roman persecution", "Jewish legalism", "False teachers and scoffers", "Lack of giving"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Easy",
    "verseReference": "2 Peter 2:1, 3:3",
    "verseText": "But false prophets also arose among the people, just as there will be false teachers among you, who will secretly bring in destructive heresies... knowing this first of all, that scoffers will come in the last days with scoffing, following their own sinful desires."
  },
  {
    "text": "In 2 Peter 1, Peter urges believers to supplement their faith with virtues like goodness, knowledge, self-control, steadfastness, godliness, brotherly affection, and what?",
    "options": ["Wealth", "Power", "Love", "Wisdom"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 1:5-7",
    "verseText": "For this very reason, make every effort to supplement your faith with virtue, and virtue with knowledge, and knowledge with self-control, and self-control with steadfastness, and steadfastness with godliness, and godliness with brotherly affection, and brotherly affection with love."
  },
  {
    "text": "Peter mentions being an eyewitness to what event involving Jesus (2 Peter 1)?",
    "options": ["His birth", "His baptism", "His transfiguration", "His ascension"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 1:16-18",
    "verseText": "For we did not follow cleverly devised myths when we made known to you the power and coming of our Lord Jesus Christ, but we were eyewitnesses of his majesty. For when he received honor and glory from God the Father, and the voice was borne to him by the Majestic Glory, “This is my beloved Son, with whom I am well pleased,” we ourselves heard this very voice borne from heaven, for we were with him on the holy mountain."
  },
  {
    "text": "According to 2 Peter 1:20-21, how did Scripture come about?",
    "options": ["Through human wisdom alone", "By accident", "Men spoke from God as they were carried along by the Holy Spirit", "It evolved over time"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Easy",
    "verseReference": "2 Peter 1:20-21",
    "verseText": "knowing this first of all, that no prophecy of Scripture comes from someone's own interpretation. For no prophecy was ever produced by the will of man, but men spoke from God as they were carried along by the Holy Spirit."
  },
  {
    "text": "In 2 Peter 2, Peter compares the false teachers to what Old Testament figures/events?",
    "options": ["Moses and Abraham", "David and Solomon", "Angels who sinned, the ancient world (Noah's flood), Sodom and Gomorrah, Balaam", "Elijah and Elisha"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Hard",
    "verseReference": "2 Peter 2:4-6, 15",
    "verseText": "For if God did not spare angels when they sinned... if he did not spare the ancient world, but preserved Noah... if by turning the cities of Sodom and Gomorrah to ashes he condemned them to extinction... Forsaking the right way, they have gone astray. They have followed the way of Balaam..."
  },
  {
    "text": "What do the scoffers mentioned in 2 Peter 3 question or deny?",
    "options": ["The existence of God", "The resurrection of Jesus", "The promise of Christ's coming (return)", "The authority of the apostles"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 3:3-4",
    "verseText": "knowing this first of all, that scoffers will come in the last days with scoffing, following their own sinful desires. They will say, “Where is the promise of his coming? For ever since the fathers fell asleep, all things are continuing as they were from the beginning of creation.”"
  },
  {
    "text": "Why does Peter say the Lord is patient, delaying His coming (2 Peter 3)?",
    "options": ["He has forgotten His promise", "He is powerless to return", "He does not wish that any should perish, but that all should reach repentance", "He is waiting for a sign"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Easy",
    "verseReference": "2 Peter 3:9",
    "verseText": "The Lord is not slow to fulfill his promise as some count slowness, but is patient toward you, not wishing that any should perish, but that all should reach repentance."
  },
  {
    "text": "How does Peter describe the Day of the Lord in 2 Peter 3?",
    "options": ["As a time of peace", "As coming like a thief, with the heavens passing away and elements being destroyed by fire", "As a gradual transition", "As uncertain"],
    "correctAnswerIndex": 1,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 3:10",
    "verseText": "But the day of the Lord will come like a thief, and then the heavens will pass away with a roar, and the heavenly bodies will be burned up and dissolved, and the earth and the works that are done on it will be exposed."
  },
  {
    "text": "Peter mentions that some things in the letters of which other apostle are hard to understand and twisted by the ignorant?",
    "options": ["James", "John", "Paul", "Himself"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 3:15-16",
    "verseText": "And count the patience of our Lord as salvation, just as our beloved brother Paul also wrote to you according to the wisdom given him, as he does in all his letters... There are some things in them that are hard to understand, which the ignorant and unstable twist to their own destruction, as they do the other Scriptures."
  },
  {
    "text": "According to 2 Peter 1, what has God's divine power granted to believers?",
    "options": ["Political authority", "Immunity from suffering", "All things that pertain to life and godliness", "Great wealth"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 1:3",
    "verseText": "His divine power has granted to us all things that pertain to life and godliness, through the knowledge of him who called us to his own glory and excellence,"
  },
  {
    "text": "Through what has God granted His precious and very great promises, enabling believers to become partakers of the divine nature?",
    "options": ["The Law of Moses", "Angelic messengers", "His own glory and excellence", "Human effort"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 1:3-4",
    "verseText": "...him who called us to his own glory and excellence, by which he has granted to us his precious and very great promises, so that through them you may become partakers of the divine nature, having escaped from the corruption that is in the world because of sinful desire."
  },
  {
    "text": "What is the consequence if the qualities mentioned in 2 Peter 1:5-7 are lacking in a believer?",
    "options": ["They lose their salvation immediately", "They are ineffective or unfruitful in the knowledge of Christ; nearsighted or blind", "They are punished by the church", "They gain worldly success"],
    "correctAnswerIndex": 1,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 1:8-9",
    "verseText": "For if these qualities are yours and are increasing, they keep you from being ineffective or unfruitful in the knowledge of our Lord Jesus Christ. For whoever lacks these qualities is so nearsighted that he is blind, having forgotten that he was cleansed from his former sins."
  },
  {
    "text": "What are believers encouraged to be diligent about in 2 Peter 1 to ensure they never fall?",
    "options": ["Attending meetings", "Paying tithes", "Confirming their calling and election", "Judging others"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 1:10",
    "verseText": "Therefore, brothers, be all the more diligent to confirm your calling and election, for if you practice these qualities you will never fall."
  },
  {
    "text": "What kind of entrance into the eternal kingdom is promised to those who practice the virtues listed in 2 Peter 1?",
    "options": ["A difficult entrance", "A temporary entrance", "A rich entrance", "An uncertain entrance"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 1:11",
    "verseText": "For in this way there will be richly provided for you an entrance into the eternal kingdom of our Lord and Savior Jesus Christ."
  },
  {
    "text": "What is Peter's stated purpose for writing this second letter (and reminding them of these things)?",
    "options": ["To ask for money", "To establish his authority", "To stir them up by way of reminder before his death", "To introduce new doctrines"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Easy",
    "verseReference": "2 Peter 1:12-15, 3:1",
    "verseText": "Therefore I intend always to remind you of these qualities... I think it right, as long as I am in this body, to stir you up by way of reminder, since I know that the putting off of my body will be soon... This is now the second letter that I am writing to you, beloved. In both of them I am stirring up your sincere mind by way of reminder,"
  },
  {
    "text": "How will the false teachers secretly bring in destructive heresies?",
    "options": ["By open declaration", "Through political force", "Secretly (among the believers)", "By performing miracles"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 2:1",
    "verseText": "But false prophets also arose among the people, just as there will be false teachers among you, who will secretly bring in destructive heresies, even denying the Master who bought them..."
  },
  {
    "text": "What is the primary motivation of the false teachers described in 2 Peter 2?",
    "options": ["Love for the truth", "Concern for the poor", "Greed", "Desire for holiness"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 2:3",
    "verseText": "And in their greed they will exploit you with false words. Their condemnation from long ago is not idle, and their destruction is not asleep."
  },
  {
    "text": "While God judged the ungodly (angels, ancient world, Sodom), who did He rescue?",
    "options": ["Everyone", "Only the wealthy", "Righteous Lot and Noah, a herald of righteousness", "Those who compromised"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 2:5, 7",
    "verseText": "...but preserved Noah, a herald of righteousness, with seven others, when he brought a flood upon the world of the ungodly... and if he rescued righteous Lot, greatly distressed by the sensual conduct of the wicked..."
  },
  {
    "text": "What characteristic is specifically mentioned regarding the false teachers' attitude towards authority?",
    "options": ["They respect it", "They despise authority", "They seek positions of authority", "They are indifferent to authority"],
    "correctAnswerIndex": 1,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 2:10",
    "verseText": "...bold and willful, they do not tremble as they blaspheme the glorious ones,"
  },
  {
    "text": "How are the false teachers described in terms of their knowledge and actions?",
    "options": ["Wise and cautious", "Blaspheming about matters they don't understand, like irrational animals", "Learned scholars", "Humble servants"],
    "correctAnswerIndex": 1,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 2:12",
    "verseText": "But these, like irrational animals, creatures of instinct, born to be caught and destroyed, blaspheming about matters of which they are ignorant, will also be destroyed in their destruction,"
  },
  {
    "text": "What Old Testament prophet is mentioned as loving the wages of unrighteousness and being rebuked by a donkey?",
    "options": ["Isaiah", "Jeremiah", "Balaam", "Ezekiel"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Easy",
    "verseReference": "2 Peter 2:15-16",
    "verseText": "Forsaking the right way, they have gone astray. They have followed the way of Balaam the son of Beor, who loved gain from wrongdoing, but was rebuked for his own transgression; a speechless donkey spoke with human voice and restrained the prophet's madness."
  },
  {
    "text": "What metaphors does Peter use to describe the emptiness of the false teachers' promises?",
    "options": ["Deep wells and bright stars", "Waterless springs and mists driven by a storm", "Fruitful trees and flowing rivers", "Solid rocks and sturdy shelters"],
    "correctAnswerIndex": 1,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 2:17",
    "verseText": "These are waterless springs and mists driven by a storm. For them the gloom of utter darkness has been reserved."
  },
  {
    "text": "What do the false teachers promise while being slaves of corruption themselves?",
    "options": ["Wealth", "Power", "Freedom", "Knowledge"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 2:19",
    "verseText": "They promise them freedom, but they themselves are slaves of corruption. For whatever overcomes a person, to that he is enslaved."
  },
  {
    "text": "According to 2 Peter 2, what is the condition of those who escape corruption but get entangled again?",
    "options": ["They are easily restored", "Their last state is worse than the first", "They are praised for trying", "They are no different than before"],
    "correctAnswerIndex": 1,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 2:20",
    "verseText": "For if, after they have escaped the defilements of the world through the knowledge of our Lord and Savior Jesus Christ, they are again entangled in them and overcome, the last state has become worse for them than the first."
  },
  {
    "text": "What proverbs illustrate the return of false teachers (and those who follow them) to their old ways?",
    "options": ["'A stitch in time saves nine'", "'The dog returns to its vomit,' and 'The sow, after washing, returns to wallow in the mire'", "'Look before you leap'", "'A bird in the hand is worth two in the bush'"],
    "correctAnswerIndex": 1,
    "book": "2 Peter",
    "difficulty": "Easy",
    "verseReference": "2 Peter 2:22",
    "verseText": "What the true proverb says has happened to them: “The dog returns to its own vomit, and the sow, after washing herself, returns to wallow in the mire.”"
  },
  {
    "text": "What do the scoffers in the last days deliberately overlook?",
    "options": ["The writings of Paul", "The creation of the heavens and earth by God's word and the judgment by the flood", "The needs of the poor", "The authority of Peter"],
    "correctAnswerIndex": 1,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 3:5-6",
    "verseText": "For they deliberately overlook this fact, that the heavens existed long ago, and the earth was formed out of water and through water by the word of God, and that by means of these the world that then existed was deluged with water and perished."
  },
  {
    "text": "By what are the present heavens and earth stored up for fire?",
    "options": ["Human decree", "Natural processes", "God's word", "Angelic power"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 3:7",
    "verseText": "But by the same word the heavens and earth that now exist are stored up for fire, being kept until the day of judgment and destruction of the ungodly."
  },
  {
    "text": "What perspective on time should believers remember regarding the Lord?",
    "options": ["Time is irrelevant to God", "With the Lord one day is as a thousand years, and a thousand years as one day", "God is bound by human time", "The Lord is always in a hurry"],
    "correctAnswerIndex": 1,
    "book": "2 Peter",
    "difficulty": "Easy",
    "verseReference": "2 Peter 3:8",
    "verseText": "But do not overlook this one fact, beloved, that with the Lord one day is as a thousand years, and a thousand years as one day."
  },
  {
    "text": "Since the elements will melt in the Day of the Lord, what kind of people ought believers to be?",
    "options": ["Fearful and despairing", "Indifferent", "Living lives of holiness and godliness", "Focused on earthly security"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Easy",
    "verseReference": "2 Peter 3:11",
    "verseText": "Since all these things are thus to be dissolved, what sort of people ought you to be in lives of holiness and godliness,"
  },
  {
    "text": "What are believers waiting for and hastening, according to 2 Peter 3?",
    "options": ["Worldly peace", "The coming of the day of God", "Personal wealth", "Political revolution"],
    "correctAnswerIndex": 1,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 3:12",
    "verseText": "waiting for and hastening the coming of the day of God, because of which the heavens will be set on fire and dissolved, and the heavenly bodies will melt as they burn!"
  },
  {
    "text": "According to God's promise, what are believers looking forward to?",
    "options": ["A restored earthly kingdom", "New heavens and a new earth in which righteousness dwells", "An escape from all responsibility", "Personal glory"],
    "correctAnswerIndex": 1,
    "book": "2 Peter",
    "difficulty": "Easy",
    "verseReference": "2 Peter 3:13",
    "verseText": "But according to his promise we are waiting for new heavens and a new earth in which righteousness dwells."
  },
  {
    "text": "Therefore, while waiting, what should believers be diligent to be found by Christ as?",
    "options": ["Wealthy and powerful", "Popular", "Without spot or blemish, and at peace", "Anxious and worried"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 3:14",
    "verseText": "Therefore, beloved, since you are waiting for these, be diligent to be found by him without spot or blemish, and at peace."
  },
  {
    "text": "How does Peter refer to Paul in his letter?",
    "options": ["As a rival", "As 'our beloved brother Paul'", "As misguided", "He doesn't mention him"],
    "correctAnswerIndex": 1,
    "book": "2 Peter",
    "difficulty": "Easy",
    "verseReference": "2 Peter 3:15",
    "verseText": "And count the patience of our Lord as salvation, just as our beloved brother Paul also wrote to you according to the wisdom given him,"
  },
  {
    "text": "Peter equates the twisting of Paul's letters with the twisting of what?",
    "options": ["Greek philosophy", "Roman law", "The other Scriptures", "Peter's own words"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 3:16",
    "verseText": "...which the ignorant and unstable twist to their own destruction, as they do the other Scriptures."
  },
  {
    "text": "Knowing these things beforehand, what should believers take care not to do?",
    "options": ["Forget Peter's warnings", "Be carried away by the error of lawless people and lose their stability", "Engage in politics", "Isolate themselves"],
    "correctAnswerIndex": 1,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 3:17",
    "verseText": "You therefore, beloved, knowing this beforehand, take care that you are not carried away with the error of lawless people and lose your own stability."
  },
  {
    "text": "What is the final command given in the book of 2 Peter?",
    "options": ["Sell all possessions", "Judge the false teachers", "Grow in the grace and knowledge of our Lord and Savior Jesus Christ", "Prepare for battle"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Easy",
    "verseReference": "2 Peter 3:18",
    "verseText": "But grow in the grace and knowledge of our Lord and Savior Jesus Christ. To him be the glory both now and to the day of eternity. Amen."
  },
  {
    "text": "What title does Peter use for Jesus that emphasizes both His deity and saving work?",
    "options": ["Good teacher", "Prophet", "Our God and Savior Jesus Christ", "King of the Jews"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 1:1",
    "verseText": "...by the righteousness of our God and Savior Jesus Christ:"
  },
  {
    "text": "The false teachers are described as denying whom?",
    "options": ["The Holy Spirit", "The Father", "The Master who bought them", "The apostles"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 2:1",
    "verseText": "...even denying the Master who bought them, bringing upon themselves swift destruction."
  },
  {
    "text": "What is said about the judgment and destruction of the false teachers?",
    "options": ["It might not happen", "It is delayed indefinitely", "Their condemnation is not idle, and their destruction is not asleep", "It can be avoided by repentance"],
    "correctAnswerIndex": 2,
    "book": "2 Peter",
    "difficulty": "Medium",
    "verseReference": "2 Peter 2:3",
    "verseText": "Their condemnation from long ago is not idle, and their destruction is not asleep."
  }
]
