[
  {
    "text": "Who wrote the Epistle to the Galatians?",
    "options": ["Peter", "James", "Paul", "John"],
    "correctAnswerIndex": 2,
    "book": "Galatians",
    "difficulty": "Easy",
    "verseReference": "Galatians 1:1",
    "verseText": "Paul, an apostle—not from men nor through man, but through Jesus Christ and God the Father, who raised him from the dead—"
  },
  {
    "text": "What major issue prompted Paul to write to the Galatians?",
    "options": ["Persecution from Rome", "Disputes about spiritual gifts", "False teachers ('Judaizers') insisting Gentile believers must follow the Mosaic Law (especially circumcision)", "Questions about the end times"],
    "correctAnswerIndex": 2,
    "book": "Galatians",
    "difficulty": "Easy",
    "verseReference": "Galatians 1:6-7, 5:2-4",
    "verseText": "I am astonished that you are so quickly deserting him who called you in the grace of Christ and are turning to a different gospel— not that there is another one, but there are some who trouble you and want to distort the gospel of Christ... Look: I, Paul, say to you that if you accept circumcision, Christ will be of no advantage to you... You are severed from Christ, you who would be justified by the law; you have fallen away from grace."
  },
  {
    "text": "In Galatians 2, Paul describes a confrontation he had with which apostle in Antioch?",
    "options": ["James", "John", "Peter (Cephas)", "Barnabas"],
    "correctAnswerIndex": 2,
    "book": "Galatians",
    "difficulty": "Medium",
    "verseReference": "Galatians 2:11, 14",
    "verseText": "But when Cephas came to Antioch, I opposed him to his face, because he stood condemned... But when I saw that their conduct was not in step with the truth of the gospel, I said to Cephas before them all, “If you, though a Jew, live like a Gentile and not like a Jew, how can you force the Gentiles to live like Jews?”"
  },
  {
    "text": "Galatians 3:28 famously declares that in Christ Jesus, 'There is neither Jew nor Greek, there is neither slave nor free, there is no...' what?",
    "options": ["Rich nor poor", "Male and female", "Young nor old", "Sick nor healthy"],
    "correctAnswerIndex": 1,
    "book": "Galatians",
    "difficulty": "Easy",
    "verseReference": "Galatians 3:28",
    "verseText": "There is neither Jew nor Greek, there is neither slave nor free, there is no male and female, for you are all one in Christ Jesus."
  },
  {
    "text": "Paul argues strongly throughout Galatians that justification (being declared righteous) comes through what?",
    "options": ["Following the Law of Moses", "Faith in Jesus Christ", "Good works and deeds", "Membership in the church"],
    "correctAnswerIndex": 1,
    "book": "Galatians",
    "difficulty": "Easy",
    "verseReference": "Galatians 2:16",
    "verseText": "yet we know that a person is not justified by works of the law but through faith in Jesus Christ, so we also have believed in Christ Jesus, in order to be justified by faith in Christ and not by works of the law, because by works of the law no one will be justified."
  },
  {
    "text": "In Galatians 4, Paul uses an allegory involving two women to contrast the covenants. Who are these two women?",
    "options": ["Sarah and Rebekah", "Leah and Rachel", "Hagar and Sarah", "Mary and Elizabeth"],
    "correctAnswerIndex": 2,
    "book": "Galatians",
    "difficulty": "Hard",
    "verseReference": "Galatians 4:22-26",
    "verseText": "For it is written that Abraham had two sons, one by a slave woman and one by a free woman. But the son of the slave was born according to the flesh, while the son of the free woman was born through promise. Now this may be interpreted allegorically: these women are two covenants. One is from Mount Sinai, bearing children for slavery; she is Hagar... But the Jerusalem above is free, and she is our mother."
  },
  {
    "text": "What does Paul say is the purpose of the Law in Galatians 3:24?",
    "options": ["To justify sinners", "To serve as a guardian (tutor/disciplinarian) until Christ came", "To provide eternal life", "To be followed perfectly by believers"],
    "correctAnswerIndex": 1,
    "book": "Galatians",
    "difficulty": "Medium",
    "verseReference": "Galatians 3:24",
    "verseText": "So then, the law was our guardian until Christ came, in order that we might be justified by faith."
  },
  {
    "text": "Galatians 5:1 states that Christ has set believers free for what?",
    "options": ["Lawlessness", "Freedom", "Service to sin", "Political revolution"],
    "correctAnswerIndex": 1,
    "book": "Galatians",
    "difficulty": "Easy",
    "verseReference": "Galatians 5:1",
    "verseText": "For freedom Christ has set us free; stand firm therefore, and do not submit again to a yoke of slavery."
  },
  {
    "text": "What list does Paul provide in Galatians 5:22-23 as evidence of the Spirit's work in a believer's life?",
    "options": ["The works of the flesh", "The gifts of the Spirit", "The fruit of the Spirit", "The commandments"],
    "correctAnswerIndex": 2,
    "book": "Galatians",
    "difficulty": "Easy",
    "verseReference": "Galatians 5:22-23",
    "verseText": "But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control; against such things there is no law."
  },
  {
    "text": "What principle does Paul state in Galatians 6:7 regarding sowing and reaping?",
    "options": ["You reap only what others sow", "You reap more than you sow", "You reap what you sow", "Sowing and reaping don't apply to believers"],
    "correctAnswerIndex": 2,
    "book": "Galatians",
    "difficulty": "Easy",
    "verseReference": "Galatians 6:7",
    "verseText": "Do not be deceived: God is not mocked, for whatever one sows, that will he also reap."
  }
]
