[
  {
    "text": "How does the Gospel of John begin?",
    "options": ["With Jesus' birth", "With Jesus' baptism", "With a prologue describing Jesus as the eternal Word (Logos)", "With the calling of disciples"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 1:1, 14",
    "verseText": "In the beginning was the Word, and the Word was with God, and the Word was God. And the Word became flesh and dwelt among us, and we have seen his glory, glory as of the only Son from the Father, full of grace and truth."
  },
  {
    "text": "Compared to the Synoptic Gospels (Matthew, Mark, Luke), John's Gospel focuses more on...",
    "options": ["Jesus' parables", "Jesus' exorcisms", "Jesus' identity, divinity, and relationship with the Father, often through long discourses", "Jesus' interactions with Gentiles"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 5:19-23",
    "verseText": "So Jesus said to them, 'Truly, truly, I say to you, the Son can do nothing of his own accord, but only what he sees the Father doing. For whatever the Father does, that the Son does likewise. For the Father loves the Son and shows him all that he himself is doing. And greater works than these will he show him, so that you may marvel. For as the Father raises the dead and gives them life, so also the Son gives life to whom he will. The Father judges no one, but has given all judgment to the Son, that all may honor the Son, just as they honor the Father.'"
  },
  {
    "text": "What is the first sign (miracle) Jesus performs in John's Gospel?",
    "options": ["Healing a blind man", "Walking on water", "Turning water into wine at Cana", "Feeding the 5000"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 2:11",
    "verseText": "This, the first of his signs, Jesus did at Cana in Galilee, and manifested his glory. And his disciples believed in him."
  },
  {
    "text": "In John 3, Jesus tells which Pharisee that one must be 'born again' (or 'born from above')?",
    "options": ["Gamaliel", "Nicodemus", "Simon", "Joseph of Arimathea"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 3:1, 3",
    "verseText": "Now there was a man of the Pharisees named Nicodemus, a ruler of the Jews. Jesus answered him, 'Truly, truly, I say to you, unless one is born again he cannot see the kingdom of God.'"
  },
  {
    "text": "John's Gospel features seven 'I am' statements by Jesus, including 'I am the bread of life', 'I am the light of the world', and...",
    "options": ["'I am the Law'", "'I am the Temple'", "'I am the good shepherd', 'I am the resurrection and the life', 'I am the way, the truth, and the life', 'I am the true vine'", "'I am the King'"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 6:35, 8:12, 10:11, 11:25, 14:6, 15:1 (cf. 10:7)",
    "verseText": "(These 'I am' statements are key declarations of Jesus' divine identity and function in John's Gospel)."
  },
  {
    "text": "Which disciple, often called 'doubting', declared 'My Lord and my God!' after seeing the resurrected Jesus (John 20)?",
    "options": ["Peter", "Andrew", "Thomas", "Philip"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 20:27-28",
    "verseText": "Then he said to Thomas, “Put your finger here, and see my hands; and put out your hand, and place it in my side. Do not disbelieve, but believe.” Thomas answered him, “My Lord and my God!”"
  },
  {
    "text": "What miracle, unique to John, involves Jesus raising his friend from the dead after four days?",
    "options": ["Raising Jairus' daughter", "Raising the widow's son at Nain", "Raising Lazarus", "Healing the centurion's servant"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 11:38-44",
    "verseText": "Then Jesus, deeply moved again, came to the tomb... Jesus said to them, “Take away the stone.”... When he had said these things, he cried out with a loud voice, “Lazarus, come out.” The man who had died came out..."
  },
  {
    "text": "John 14-16 contains Jesus' Farewell Discourse to his disciples, promising the coming of whom?",
    "options": ["Angels", "Another prophet", "The Holy Spirit (the Helper/Advocate/Comforter)", "Elijah"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 14:16-17, 26; 15:26; 16:7",
    "verseText": "And I will ask the Father, and he will give you another Helper, to be with you forever, even the Spirit of truth... But the Helper, the Holy Spirit, whom the Father will send in my name, he will teach you all things..."
  },
  {
    "text": "What is the stated purpose of John's Gospel (John 20:31)?",
    "options": ["To provide a complete history of Jesus' life", "To encourage Jewish believers", "That readers may believe Jesus is the Christ, the Son of God, and have life in his name", "To condemn the Roman authorities"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 20:31",
    "verseText": "but these are written so that you may believe that Jesus is the Christ, the Son of God, and that by believing you may have life in his name."
  },
  {
    "text": "The author of John's Gospel identifies himself using what phrase?",
    "options": ["'John, son of Zebedee'", "'The Apostle'", "'The disciple whom Jesus loved'", "'An eyewitness'"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 13:23, 19:26, 20:2, 21:7, 21:20, 24",
    "verseText": "(The author refers to himself as 'the disciple whom Jesus loved', traditionally identified as the Apostle John)."
  },
  {
    "text": "What title does John the Baptist use for Jesus when he sees him coming (John 1)?",
    "options": ["'Son of David'", "'The Messiah'", "'The Lamb of God, who takes away the sin of the world!'", "'The King of Israel'"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 1:29",
    "verseText": "The next day he saw Jesus coming toward him, and said, “Behold, the Lamb of God, who takes away the sin of the world!"
  },
  {
    "text": "Who were the first two disciples to follow Jesus after hearing John the Baptist's testimony (John 1)?",
    "options": ["Peter and James", "Andrew and another disciple (likely John, the author)", "Philip and Nathanael", "Matthew and Thomas"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 1:35-37, 40",
    "verseText": "The next day again John was standing with two of his disciples, and he looked at Jesus as he walked by and said, “Behold, the Lamb of God!” The two disciples heard him say this, and they followed Jesus... One of the two who heard John speak and followed Jesus was Andrew, Simon Peter's brother."
  },
  {
    "text": "What did Jesus say to Nathanael that convinced him Jesus was the Son of God (John 1)?",
    "options": ["He healed his relative", "He knew Nathanael was under the fig tree before Philip called him", "He quoted scripture", "He performed a miracle"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 1:48-49",
    "verseText": "Nathanael said to him, “How do you know me?” Jesus answered him, “Before Philip called you, when you were under the fig tree, I saw you.” Nathanael answered him, “Rabbi, you are the Son of God! You are the King of Israel!”"
  },
  {
    "text": "What action did Jesus take in the temple courts in John 2?",
    "options": ["He taught the crowds", "He healed the sick", "He drove out those selling animals and exchanging money, making a whip of cords", "He debated with the priests"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 2:14-16",
    "verseText": "In the temple he found those who were selling oxen and sheep and pigeons, and the money-changers sitting there. And making a whip of cords, he drove them all out of the temple, with the sheep and oxen. And he poured out the coins of the money-changers and overturned their tables."
  },
  {
    "text": "When the Jews asked for a sign after the temple clearing, what sign did Jesus say he would give (John 2)?",
    "options": ["Turning water to wine", "Healing a blind man", "'Destroy this temple, and in three days I will raise it up' (referring to his body)", "Feeding the multitude"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 2:19, 21",
    "verseText": "Jesus answered them, “Destroy this temple, and in three days I will raise it up.”... But he was speaking about the temple of his body."
  },
  {
    "text": "What famous verse, summarizing the gospel message, comes from Jesus' conversation with Nicodemus (John 3)?",
    "options": ["John 1:1", "John 3:16 ('For God so loved the world...')", "John 11:25", "John 14:6"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 3:16",
    "verseText": "“For God so loved the world, that he gave his only Son, that whoever believes in him should not perish but have eternal life."
  },
  {
    "text": "With whom did Jesus have a significant conversation by a well in Samaria (John 4)?",
    "options": ["A Roman soldier", "A Samaritan woman", "A tax collector", "A group of children"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 4:7, 9",
    "verseText": "A woman from Samaria came to draw water. Jesus said to her, “Give me a drink.”... The Samaritan woman said to him, “How is it that you, a Jew, ask for a drink from me, a woman of Samaria?” (For Jews have no dealings with Samaritans.)"
  },
  {
    "text": "What kind of 'water' did Jesus offer the Samaritan woman (John 4)?",
    "options": ["Water from the Jordan", "Water from the well", "Living water (referring to the Holy Spirit/eternal life)", "Wine"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 4:10, 14",
    "verseText": "Jesus answered her, “If you knew the gift of God, and who it is that is saying to you, ‘Give me a drink,’ you would have asked him, and he would have given you living water.”... “but whoever drinks of the water that I will give him will never be thirsty again. The water that I will give him will become in him a spring of water welling up to eternal life.”"
  },
  {
    "text": "What was the second sign Jesus performed in Cana, according to John 4?",
    "options": ["Calming the storm", "Healing an official's son who was in Capernaum", "Walking on water", "Casting out a demon"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 4:46-47, 54",
    "verseText": "So he came again to Cana in Galilee, where he had made the water wine. And at Capernaum there was an official whose son was ill. When this man heard that Jesus had come from Judea to Galilee, he went to him and asked him to come down and heal his son... This was now the second sign that Jesus did when he had come from Judea to Galilee."
  },
  {
    "text": "What miracle did Jesus perform at the Pool of Bethesda (John 5)?",
    "options": ["He walked on the water", "He healed a man who had been an invalid for 38 years", "He turned water into wine", "He fed 5000 people"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 5:5, 8-9",
    "verseText": "One man was there who had been an invalid for thirty-eight years... Jesus said to him, “Get up, take up your bed, and walk.” And at once the man was healed, and he took up his bed and walked."
  },
  {
    "text": "Why did the Jewish leaders persecute Jesus after the healing at Bethesda (John 5)?",
    "options": ["He didn't pay the temple tax", "He healed on the Sabbath and called God his own Father, making himself equal with God", "He associated with sinners", "He challenged their authority"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 5:16, 18",
    "verseText": "And this was why the Jews were persecuting Jesus, because he was doing these things on the Sabbath... This was why the Jews were seeking all the more to kill him, because not only was he breaking the Sabbath, but he was even calling God his own Father, making himself equal with God."
  },
  {
    "text": "In John 6, after feeding the 5000, Jesus delivered a discourse centered on which 'I am' statement?",
    "options": ["'I am the light of the world'", "'I am the good shepherd'", "'I am the bread of life'", "'I am the true vine'"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 6:35",
    "verseText": "Jesus said to them, “I am the bread of life; whoever comes to me shall not hunger, and whoever believes in me shall never thirst."
  },
  {
    "text": "What did Jesus say people must do to have eternal life, causing many disciples to turn back (John 6)?",
    "options": ["Sell all their possessions", "'Eat the flesh of the Son of Man and drink his blood'", "Follow the Law perfectly", "Perform miracles"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Hard",
    "verseReference": "John 6:53-54, 66",
    "verseText": "So Jesus said to them, “Truly, truly, I say to you, unless you eat the flesh of the Son of Man and drink his blood, you have no life in you. Whoever feeds on my flesh and drinks my blood has eternal life...” After this many of his disciples turned back and no longer walked with him."
  },
  {
    "text": "When many disciples left, what was Peter's response when Jesus asked if the Twelve also wanted to leave (John 6)?",
    "options": ["'We don't understand you'", "'Lord, to whom shall we go? You have the words of eternal life.'", "'Let us think about it'", "'We must follow the Law'"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 6:67-68",
    "verseText": "So Jesus said to the Twelve, “Do you want to go away as well?” Simon Peter answered him, “Lord, to whom shall we go? You have the words of eternal life,"
  },
  {
    "text": "During the Feast of Tabernacles (John 7), what did Jesus cry out, inviting people to come to him?",
    "options": ["'Repent, for the kingdom is near!'", "'If anyone thirsts, let him come to me and drink.'", "'I am the Messiah!'", "'Follow me!'"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 7:37",
    "verseText": "On the last day of the feast, the great day, Jesus stood up and cried out, “If anyone thirsts, let him come to me and drink."
  },
  {
    "text": "What did Jesus say to the woman caught in adultery after her accusers left (John 8)?",
    "options": ["'You are condemned'", "'Where are your accusers? Neither do I condemn you; go, and from now on sin no more.'", "'Offer a sacrifice'", "'You must leave the city'"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 8:10-11",
    "verseText": "Jesus stood up and said to her, “Woman, where are they? Has no one condemned you?” She said, “No one, Lord.” And Jesus said, “Neither do I condemn you; go, and from now on sin no more.”"
  },
  {
    "text": "Which 'I am' statement did Jesus make in the context of the woman caught in adultery (John 8)?",
    "options": ["'I am the bread of life'", "'I am the light of the world'", "'I am the good shepherd'", "'I am the resurrection and the life'"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 8:12",
    "verseText": "Again Jesus spoke to them, saying, “I am the light of the world. Whoever follows me will not walk in darkness, but will have the light of life.”"
  },
  {
    "text": "Jesus told the Jews who had believed in him, 'If you abide in my word, you are truly my disciples, and you will know the truth, and the truth will...' (John 8)?",
    "options": ["'...make you wise'", "'...set you free'", "'...give you peace'", "'...lead you to God'"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 8:31-32",
    "verseText": "So Jesus said to the Jews who had believed him, “If you abide in my word, you are truly my disciples, and you will know the truth, and the truth will set you free.”"
  },
  {
    "text": "What statement by Jesus caused the Jews to pick up stones to kill him in John 8?",
    "options": ["'I am the light of the world'", "'You are of your father the devil'", "'Truly, truly, I say to you, before Abraham was, I am.'", "'I and the Father are one'"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Hard",
    "verseReference": "John 8:58-59",
    "verseText": "Jesus said to them, “Truly, truly, I say to you, before Abraham was, I am.” So they picked up stones to throw at him..."
  },
  {
    "text": "When Jesus healed the man born blind (John 9), what did the man eventually confess about Jesus?",
    "options": ["He didn't know who healed him", "'Lord, I believe.'", "He was just a prophet", "He was Elijah"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 9:35, 38",
    "verseText": "Jesus heard that they had cast him out, and having found him he said, “Do you believe in the Son of Man?”... He said, “Lord, I believe,” and he worshiped him."
  },
  {
    "text": "In John 10, Jesus uses the metaphor of a shepherd and his sheep. Which 'I am' statements does he make here?",
    "options": ["'I am the bread of life' and 'I am the light'", "'I am the door (gate) of the sheep' and 'I am the good shepherd'", "'I am the resurrection and the life' and 'I am the way'", "'I am the true vine' and 'I am the King'"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 10:7, 11",
    "verseText": "So Jesus again said to them, “Truly, truly, I say to you, I am the door of the sheep... I am the good shepherd. The good shepherd lays down his life for the sheep."
  },
  {
    "text": "What did Jesus say is the defining characteristic of the good shepherd (John 10)?",
    "options": ["He has many sheep", "He knows the way", "He lays down his life for the sheep", "He carries a staff"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 10:11",
    "verseText": "I am the good shepherd. The good shepherd lays down his life for the sheep."
  },
  {
    "text": "What statement by Jesus again provoked the Jews to want to stone him in John 10?",
    "options": ["'Before Abraham was, I am'", "'I am the good shepherd'", "'I and the Father are one.'", "'Destroy this temple...'"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 10:30-31",
    "verseText": "I and the Father are one.” The Jews picked up stones again to stone him."
  },
  {
    "text": "Who objected when Mary anointed Jesus' feet with expensive ointment (John 12)?",
    "options": ["Peter", "Martha", "Judas Iscariot", "The Pharisees"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 12:3-5",
    "verseText": "Mary therefore took a pound of expensive ointment... and anointed the feet of Jesus... But Judas Iscariot, one of his disciples (he who was about to betray him), said, “Why was this ointment not sold for three hundred denarii and given to the poor?”"
  },
  {
    "text": "What humble action did Jesus perform for his disciples before the Last Supper (John 13)?",
    "options": ["He cooked for them", "He washed their feet", "He gave them money", "He prayed for each individually"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 13:4-5",
    "verseText": "rose from supper. He laid aside his outer garments, and taking a towel, tied it around his waist. Then he poured water into a basin and began to wash the disciples' feet and to wipe them with the towel that was wrapped around him."
  },
  {
    "text": "What 'new commandment' did Jesus give his disciples in John 13?",
    "options": ["'Love God only'", "'Keep the Sabbath'", "'Love one another; just as I have loved you'", "'Make disciples of all nations'"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 13:34",
    "verseText": "A new commandment I give to you, that you love one another: just as I have loved you, you also are to love one another."
  },
  {
    "text": "Which disciple asked Jesus, 'Lord, we do not know where you are going. How can we know the way?' (John 14)?",
    "options": ["Peter", "Thomas", "Philip", "Andrew"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 14:5",
    "verseText": "Thomas said to him, “Lord, we do not know where you are going. How can we know the way?”"
  },
  {
    "text": "What is Jesus' response to Thomas' question about the way (John 14)?",
    "options": ["'Follow the map'", "'Ask the Father'", "'I am the way, and the truth, and the life. No one comes to the Father except through me.'", "'Love one another'"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 14:6",
    "verseText": "Jesus said to him, “I am the way, and the truth, and the life. No one comes to the Father except through me."
  },
  {
    "text": "Which disciple asked Jesus, 'Lord, show us the Father, and it is enough for us' (John 14)?",
    "options": ["Peter", "Thomas", "Philip", "Judas (not Iscariot)"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 14:8",
    "verseText": "Philip said to him, “Lord, show us the Father, and it is enough for us.”"
  },
  {
    "text": "What did Jesus say to Philip's request to see the Father (John 14)?",
    "options": ["'No one can see the Father'", "'Look up into heaven'", "'Whoever has seen me has seen the Father'", "'Wait for the Spirit'"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 14:9",
    "verseText": "Jesus said to him, “Have I been with you so long, and you still do not know me, Philip? Whoever has seen me has seen the Father. How can you say, ‘Show us the Father’?"
  },
  {
    "text": "In John 15, Jesus uses the metaphor of the vine and the branches. Which 'I am' statement is central here?",
    "options": ["'I am the bread of life'", "'I am the light of the world'", "'I am the true vine'", "'I am the good shepherd'"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 15:1, 5",
    "verseText": "“I am the true vine, and my Father is the vinedresser... I am the vine; you are the branches. Whoever abides in me and I in him, he it is that bears much fruit, for apart from me you can do nothing."
  },
  {
    "text": "What does Jesus say is the key to bearing fruit, according to John 15?",
    "options": ["Working hard", "Abiding in Him (the Vine)", "Following the Law", "Having enough water"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 15:4-5",
    "verseText": "Abide in me, and I in you. As the branch cannot bear fruit by itself, unless it abides in the vine, neither can you, unless you abide in me. I am the vine; you are the branches. Whoever abides in me and I in him, he it is that bears much fruit..."
  },
  {
    "text": "What does Jesus say is the greatest love (John 15)?",
    "options": ["Love for God", "Love for family", "To lay down one's life for one's friends", "Love for oneself"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 15:13",
    "verseText": "Greater love has no one than this, that someone lay down his life for his friends."
  },
  {
    "text": "What work will the Holy Spirit do when He comes, according to John 16?",
    "options": ["Perform miracles", "Convict the world concerning sin, righteousness, and judgment", "Build a temple", "Lead armies"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 16:8",
    "verseText": "And when he comes, he will convict the world concerning sin and righteousness and judgment:"
  },
  {
    "text": "John 17 records Jesus' High Priestly Prayer. For whom does Jesus primarily pray?",
    "options": ["For the Romans", "For the world", "For Himself, His immediate disciples, and all future believers", "For the Jewish leaders"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 17:1, 6, 9, 20",
    "verseText": "(Jesus prays for His glorification, then for the protection and sanctification of the disciples He had, and finally for the unity of all who would believe through their message)."
  },
  {
    "text": "What is the central request Jesus makes for all believers in John 17?",
    "options": ["That they would be wealthy", "That they would be powerful", "That they may all be one (unity)", "That they would perform miracles"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 17:20-21",
    "verseText": "“I do not ask for these only, but also for those who will believe in me through their word, that they may all be one, just as you, Father, are in me, and I in you, that they also may be in us, so that the world may believe that you have sent me."
  },
  {
    "text": "When the soldiers came to arrest Jesus, and He said 'I am he', what was their reaction (John 18)?",
    "options": ["They laughed", "They drew back and fell to the ground", "They immediately seized him", "They argued among themselves"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 18:4-6",
    "verseText": "Then Jesus, knowing all that would happen to him, came forward and said to them, “Whom do you seek?” They answered him, “Jesus of Nazareth.” Jesus said to them, “I am he.”... When Jesus said to them, “I am he,” they drew back and fell to the ground."
  },
  {
    "text": "Which disciple cut off the ear of the high priest's servant during Jesus' arrest (John 18)?",
    "options": ["John", "James", "Peter", "Andrew"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 18:10",
    "verseText": "Then Simon Peter, having a sword, drew it and struck the high priest's servant and cut off his right ear. (The servant's name was Malchus.)"
  },
  {
    "text": "Before whom was Jesus first taken after his arrest, according to John's Gospel (John 18)?",
    "options": ["Pilate", "Herod", "Caiaphas", "Annas (father-in-law of Caiaphas)"],
    "correctAnswerIndex": 3,
    "book": "John",
    "difficulty": "Hard",
    "verseReference": "John 18:13",
    "verseText": "First they led him to Annas, for he was the father-in-law of Caiaphas, who was high priest that year."
  },
  {
    "text": "What question did Pilate ask Jesus, to which Jesus replied, 'My kingdom is not of this world' (John 18)?",
    "options": ["'Are you the Son of God?'", "'Are you the King of the Jews?'", "'What have you done?'", "'Where are you from?'"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 18:33, 36",
    "verseText": "So Pilate entered his headquarters again and called Jesus and said to him, “Are you the King of the Jews?”... Jesus answered, “My kingdom is not of this world..."
  },
  {
    "text": "What famous, perhaps cynical, question did Pilate ask Jesus after Jesus spoke about bearing witness to the truth (John 18)?",
    "options": ["'What is truth?'", "'What is justice?'", "'Who are you?'", "'Why have you come?'"],
    "correctAnswerIndex": 0,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 18:37-38",
    "verseText": "Then Pilate said to him, “So you are a king?” Jesus answered, “You say that I am a king. For this purpose I was born and for this purpose I have come into the world—to bear witness to the truth. Everyone who is of the truth listens to my voice.” Pilate said to him, “What is truth?”"
  },
  {
    "text": "What statement did the Jewish leaders make that pressured Pilate into crucifying Jesus (John 19)?",
    "options": ["'He stirs up the people'", "'He opposes paying taxes to Caesar'", "'If you release this man, you are not Caesar's friend. Everyone who makes himself a king opposes Caesar.'", "'Crucify him!'"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 19:12",
    "verseText": "From then on Pilate sought to release him, but the Jews cried out, “If you release this man, you are not Caesar's friend. Everyone who makes himself a king opposes Caesar.”"
  },
  {
    "text": "Which disciple did Jesus entrust his mother Mary to while on the cross (John 19)?",
    "options": ["Peter", "James", "The disciple whom he loved (John)", "Andrew"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 19:26-27",
    "verseText": "When Jesus saw his mother and the disciple whom he loved standing nearby, he said to his mother, “Woman, behold, your son!” Then he said to the disciple, “Behold, your mother!” And from that hour the disciple took her to his own home."
  },
  {
    "text": "What were Jesus' final words from the cross, according to John's Gospel (John 19)?",
    "options": ["'My God, my God, why...'", "'Father, forgive them'", "'It is finished.'", "'Into your hands I commit my spirit'"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 19:30",
    "verseText": "When Jesus had received the sour wine, he said, “It is finished,” and he bowed his head and gave up his spirit."
  },
  {
    "text": "Why did the soldiers break the legs of the two criminals crucified with Jesus, but not Jesus' legs (John 19)?",
    "options": ["They ran out of time", "They forgot", "Jesus was already dead, fulfilling prophecy", "Pilate ordered them not to"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 19:32-33, 36",
    "verseText": "So the soldiers came and broke the legs of the first, and of the other who had been crucified with him. But when they came to Jesus and saw that he was already dead, they did not break his legs... For these things took place that the Scripture might be fulfilled: “Not one of his bones will be broken.”"
  },
  {
    "text": "Who was the first person Jesus appeared to after his resurrection, according to John 20?",
    "options": ["Peter", "The disciples as a group", "Mary Magdalene", "Thomas"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 20:14, 16",
    "verseText": "Having said this, she turned around and saw Jesus standing, but she did not know that it was Jesus... Jesus said to her, “Mary.” She turned and said to him in Aramaic, “Rabboni!” (which means Teacher)."
  },
  {
    "text": "What did Jesus do when he appeared to the disciples (excluding Thomas) on the evening of the resurrection (John 20)?",
    "options": ["He ate with them", "He showed them his hands and side, said 'Peace be with you,' and breathed on them, saying 'Receive the Holy Spirit'", "He gave them the Great Commission", "He ascended to heaven"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 20:19-22",
    "verseText": "On the evening of that day, the first day of the week... Jesus came and stood among them and said to them, “Peace be with you.” When he had said this, he showed them his hands and his side... Jesus said to them again, “Peace be with you. As the Father has sent me, even so I am sending you.” And when he had said this, he breathed on them and said to them, “Receive the Holy Spirit."
  },
  {
    "text": "What blessing did Jesus pronounce related to Thomas's belief (John 20)?",
    "options": ["'Blessed are your eyes, for they see'", "'Blessed are those who believe without seeing'", "'Blessed are you, Thomas'", "'Belief comes through signs'"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 20:29",
    "verseText": "Jesus said to him, “Have you believed because you have seen me? Blessed are those who have not seen and yet have believed.”"
  },
  {
    "text": "In John 21, Jesus appears to the disciples by which sea?",
    "options": ["The Mediterranean Sea", "The Dead Sea", "The Sea of Tiberias (Galilee)", "The Red Sea"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 21:1",
    "verseText": "After this Jesus revealed himself again to the disciples by the Sea of Tiberias; and he revealed himself in this way."
  },
  {
    "text": "What miracle did Jesus perform for the disciples fishing in John 21?",
    "options": ["Calming the storm", "Walking on water", "A miraculous catch of 153 large fish", "Multiplying their bread"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 21:6, 11",
    "verseText": "He said to them, “Cast the net on the right side of the boat, and you will find some.” So they cast it, and now they were not able to haul it in, because of the quantity of fish... So Simon Peter went aboard and hauled the net ashore, full of large fish, 153 of them."
  },
  {
    "text": "What question did Jesus ask Peter three times after breakfast in John 21?",
    "options": ["'Will you betray me?'", "'Do you understand?'", "'Simon, son of John, do you love me?'", "'Will you follow me?'"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 21:15, 16, 17",
    "verseText": "When they had finished breakfast, Jesus said to Simon Peter, “Simon, son of John, do you love me more than these?”... He said to him a second time, “Simon, son of John, do you love me?”... He said to him the third time, “Simon, son of John, do you love me?”"
  },
  {
    "text": "What command did Jesus give Peter each time Peter affirmed his love (John 21)?",
    "options": ["'Follow me'", "'Feed my lambs' / 'Tend my sheep' / 'Feed my sheep'", "'Go and make disciples'", "'Be watchful'"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 21:15, 16, 17",
    "verseText": "...He said to him, “Feed my lambs.”... He said to him, “Tend my sheep.”... Jesus said to him, “Feed my sheep.”"
  },
  {
    "text": "What did Jesus predict about Peter's future death (John 21)?",
    "options": ["He would die peacefully", "He would be martyred ('stretch out your hands... carry you where you do not want to go')", "He would die in battle", "He would live a long life"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Hard",
    "verseReference": "John 21:18-19",
    "verseText": "Truly, truly, I say to you, when you were young, you used to dress yourself and walk wherever you wanted, but when you are old, you will stretch out your hands, and another will dress you and carry you where you do not want to go.” (This he said to show by what kind of death he was to glorify God.)"
  },
  {
    "text": "What reason did Jesus give for the man in John 9 being born blind?",
    "options": ["His parents sinned", "He sinned", "So that the works of God might be displayed in him", "It was a random occurrence"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 9:2-3",
    "verseText": "And his disciples asked him, “Rabbi, who sinned, this man or his parents, that he was born blind?” Jesus answered, “It was not that this man sinned, or his parents, but that the works of God might be displayed in him."
  },
  {
    "text": "After healing the man born blind, what did Jesus use as a metaphor for the spiritual blindness of the Pharisees?",
    "options": ["Darkness", "Night", "Blindness", "Sleep"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 9:39-41",
    "verseText": "Jesus said, “For judgment I came into this world, that those who do not see may see, and those who see may become blind.” Some of the Pharisees near him heard these things, and said to him, “Are we also blind?” Jesus said to them, “If you were blind, you would have no guilt; but now that you say, ‘We see,’ your guilt remains."
  },
  {
    "text": "In the Good Shepherd discourse, what does Jesus say the hired hand does when the wolf comes?",
    "options": ["Fights the wolf", "Protects the sheep", "Leaves the sheep and flees", "Hides"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 10:12-13",
    "verseText": "He who is a hired hand and not a shepherd, who does not own the sheep, sees the wolf coming and leaves the sheep and flees, and the wolf snatches them and scatters them. He flees because he is a hired hand and cares nothing for the sheep."
  },
  {
    "text": "Jesus mentions having 'other sheep that are not of this fold'. What does he say he must do with them?",
    "options": ["Ignore them", "Build a separate fold for them", "Bring them also, so there will be one flock, one shepherd", "Send the disciples to them later"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 10:16",
    "verseText": "And I have other sheep that are not of this fold. I must bring them also, and they will listen to my voice. So there will be one flock, one shepherd."
  },
  {
    "text": "Why did Jesus delay going to Lazarus when he heard he was ill?",
    "options": ["He was too busy", "He didn't care", "For the glory of God, so the Son of God may be glorified through it", "He was afraid of the Jews"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 11:4-6",
    "verseText": "But when Jesus heard it he said, “This illness does not lead to death. It is for the glory of God, so that the Son of God may be glorified through it.” Now Jesus loved Martha and her sister and Lazarus. So, when he heard that Lazarus was ill, he stayed two days longer in the place where he was."
  },
  {
    "text": "Which sister of Lazarus sat at Jesus' feet listening while the other was busy serving?",
    "options": ["Martha", "Mary", "Salome", "Susanna"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "Luke 10:39 (Context for John 11-12)",
    "verseText": "(While the specific scene is in Luke, John identifies Mary as the one who anointed Jesus (John 11:2), connecting her contemplative nature across gospels)."
  },
  {
    "text": "What did Martha confess to Jesus before Lazarus was raised?",
    "options": ["She doubted Jesus could help", "'I believe that you are the Christ, the Son of God, who is coming into the world.'", "She wished Jesus had come sooner", "She didn't understand why Lazarus died"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 11:27",
    "verseText": "She said to him, “Yes, Lord; I believe that you are the Christ, the Son of God, who is coming into the world.”"
  },
  {
    "text": "What was the reaction of the chief priests and Pharisees to the raising of Lazarus?",
    "options": ["They rejoiced and believed", "They ignored it", "They called a council and plotted to kill Jesus", "They asked Jesus to perform another sign"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 11:47, 53",
    "verseText": "So the chief priests and the Pharisees gathered the council and said, “What are we to do? For this man performs many signs... So from that day on they made plans to put him to death."
  },
  {
    "text": "Who unwittingly prophesied that it was better for one man to die for the people?",
    "options": ["Pilate", "Annas", "Caiaphas, the high priest", "A Pharisee"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 11:49-52",
    "verseText": "But one of them, Caiaphas, who was high priest that year, said to them, “You know nothing at all. Nor do you understand that it is better for you that one man should die for the people, not that the whole nation should perish.” He did not say this of his own accord, but being high priest that year he prophesied that Jesus would die for the nation..."
  },
  {
    "text": "What event prompted some Greeks (Gentiles) to seek Jesus?",
    "options": ["The feeding of the 5000", "The healing of the blind man", "Jesus' triumphal entry into Jerusalem", "The raising of Lazarus"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 12:20-22",
    "verseText": "Now among those who went up to worship at the feast were some Greeks. So these came to Philip, who was from Bethsaida in Galilee, and asked him, “Sir, we wish to see Jesus.” Philip went and told Andrew; Andrew and Philip went and told Jesus."
  },
  {
    "text": "When the Greeks sought Jesus, what analogy did Jesus use about a grain of wheat?",
    "options": ["It must be watered to grow", "It must fall into the earth and die to bear much fruit", "It must be ground into flour", "It must be planted in good soil"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 12:24",
    "verseText": "Truly, truly, I say to you, unless a grain of wheat falls into the earth and dies, it remains alone; but if it dies, it bears much fruit."
  },
  {
    "text": "What did Jesus say would happen if he were 'lifted up from the earth'?",
    "options": ["He would ascend to heaven", "He would draw all people to himself", "He would judge the world", "He would return immediately"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 12:32-33",
    "verseText": "And I, when I am lifted up from the earth, will draw all people to myself.” He said this to show by what kind of death he was going to die."
  },
  {
    "text": "Despite Jesus performing many signs, why did many not believe in him, according to John?",
    "options": ["The signs weren't convincing enough", "They didn't see the signs", "To fulfill the word of Isaiah the prophet", "Jesus told them not to believe"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Hard",
    "verseReference": "John 12:37-38",
    "verseText": "Though he had done so many signs before them, they still did not believe in him, so that the word spoken by the prophet Isaiah might be fulfilled: “Lord, who has believed what he heard from us, and to whom has the arm of the Lord been revealed?”"
  },
  {
    "text": "Which disciple initially refused to let Jesus wash his feet?",
    "options": ["John", "Judas", "Thomas", "Peter"],
    "correctAnswerIndex": 3,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 13:6, 8",
    "verseText": "He came to Simon Peter, who said to him, “Lord, do you wash my feet?”... Peter said to him, “You shall never wash my feet.” Jesus answered him, “If I do not wash you, you have no share with me.”"
  },
  {
    "text": "After washing the disciples' feet, what did Jesus say was the purpose of his example?",
    "options": ["To show his power", "To demonstrate proper hygiene", "That they should do as he had done to them (serve one another)", "To prepare for his death"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 13:14-15",
    "verseText": "If I then, your Lord and Teacher, have washed your feet, you also ought to wash one another's feet. For I have given you an example, that you also should do just as I have done to you."
  },
  {
    "text": "How did Jesus indicate who would betray him at the Last Supper?",
    "options": ["He pointed at Judas", "He announced Judas' name", "He gave a piece of bread dipped in the dish to Judas", "He told John secretly"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 13:26",
    "verseText": "Jesus answered, “It is he to whom I will give this morsel of bread when I have dipped it.” So when he had dipped the morsel, he gave it to Judas, the son of Simon Iscariot."
  },
  {
    "text": "Immediately after Judas left the Last Supper, what did Jesus say?",
    "options": ["'Let us go from here.'", "'Now is the Son of Man glorified, and God is glorified in him.'", "'One of you will betray me.'", "'Keep watch and pray.'"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 13:31",
    "verseText": "When he had gone out, Jesus said, “Now is the Son of Man glorified, and God is glorified in him."
  },
  {
    "text": "What did Jesus predict Peter would do before the rooster crowed?",
    "options": ["Catch many fish", "Deny him three times", "Fall asleep", "Betray him"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 13:38",
    "verseText": "Jesus answered, “Will you lay down your life for me? Truly, truly, I say to you, the rooster will not crow till you have denied me three times."
  },
  {
    "text": "In the Farewell Discourse, Jesus says he is going away to do what?",
    "options": ["To rest", "To prepare a place for his disciples", "To fight Satan", "To judge the nations"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 14:2-3",
    "verseText": "In my Father's house are many rooms. If it were not so, would I have told you that I go to prepare a place for you? And if I go and prepare a place for you, I will come again and will take you to myself, that where I am you may be also."
  },
  {
    "text": "Jesus promised that the Father would send the Holy Spirit (Helper) in whose name?",
    "options": ["Abraham's name", "Moses' name", "Jesus' name", "The Spirit's own name"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 14:26",
    "verseText": "But the Helper, the Holy Spirit, whom the Father will send in my name, he will teach you all things and bring to your remembrance all that I have said to you."
  },
  {
    "text": "What kind of peace did Jesus say he gives, unlike the world's peace?",
    "options": ["Temporary peace", "Financial security", "His own peace (inner tranquility despite circumstances)", "Political peace"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 14:27",
    "verseText": "Peace I leave with you; my peace I give to you. Not as the world gives do I give to you. Let not your hearts be troubled, neither let them be afraid."
  },
  {
    "text": "In the vine and branches analogy, who is the vinedresser?",
    "options": ["Jesus", "The Holy Spirit", "The disciples", "The Father"],
    "correctAnswerIndex": 3,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 15:1",
    "verseText": "“I am the true vine, and my Father is the vinedresser."
  },
  {
    "text": "What happens to a branch that does not abide in the vine (Jesus)?",
    "options": ["It grows wild", "It is taken away, withers, and is burned", "It bears different fruit", "It becomes part of another vine"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 15:2, 6",
    "verseText": "Every branch in me that does not bear fruit he takes away... If anyone does not abide in me he is thrown away like a branch and withers; and the branches are gathered, thrown into the fire, and burned."
  },
  {
    "text": "Jesus said he chose his disciples out of the world. Because of this, how would the world treat them?",
    "options": ["It would love them", "It would ignore them", "It would hate them", "It would try to understand them"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 15:18-19",
    "verseText": "“If the world hates you, know that it has hated me before it hated you. If you were of the world, the world would love you as its own; but because you are not of the world, but I chose you out of the world, therefore the world hates you."
  },
  {
    "text": "Jesus warned that a time was coming when those who killed his followers would think they were doing what?",
    "options": ["Committing a crime", "Offering service to God", "Avenging insults", "Following Roman law"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 16:2",
    "verseText": "They will put you out of the synagogues. Indeed, the hour is coming when whoever kills you will think he is offering service to God."
  },
  {
    "text": "Why did Jesus say it was to the disciples' advantage that he go away?",
    "options": ["So they could rest", "So the Helper (Holy Spirit) would come", "So they could lead", "So he could prepare their place (mentioned earlier, but reason for advantage here is the Spirit)"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 16:7",
    "verseText": "Nevertheless, I tell you the truth: it is to your advantage that I go away, for if I do not go away, the Helper will not come to you. But if I go, I will send him to you."
  },
  {
    "text": "What specific things did Jesus say the Holy Spirit would guide the disciples into?",
    "options": ["Worldly wisdom", "Political power", "All the truth", "Hidden secrets"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 16:13",
    "verseText": "When the Spirit of truth comes, he will guide you into all the truth, for he will not speak on his own authority, but whatever he hears he will speak, and he will declare to you the things that are to come."
  },
  {
    "text": "Jesus predicted the disciples' sorrow would turn into what?",
    "options": ["Anger", "Fear", "Joy", "Confusion"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 16:20",
    "verseText": "Truly, truly, I say to you, you will weep and lament, but the world will rejoice. You will be sorrowful, but your sorrow will turn into joy."
  },
  {
    "text": "In his High Priestly Prayer, what did Jesus ask the Father to do for him?",
    "options": ["Let him escape death", "Glorify him with the glory he had before the world existed", "Give him legions of angels", "Strike down his enemies"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 17:5",
    "verseText": "And now, Father, glorify me in your own presence with the glory that I had with you before the world existed."
  },
  {
    "text": "Jesus prayed for his disciples to be protected from whom?",
    "options": ["The Romans", "Poverty", "The evil one", "Physical harm"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 17:15",
    "verseText": "I do not ask that you take them out of the world, but that you keep them from the evil one."
  },
  {
    "text": "What did Jesus pray would sanctify (set apart) his followers?",
    "options": ["Their good works", "The Law of Moses", "The truth (God's word)", "Ritual washing"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 17:17",
    "verseText": "Sanctify them in the truth; your word is truth."
  },
  {
    "text": "What did Jesus desire for all believers regarding his glory?",
    "options": ["That they would imagine it", "That they would be with him to see his glory", "That they would receive equal glory", "That they would write about it"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 17:24",
    "verseText": "Father, I desire that they also, whom you have given me, may be with me where I am, to see my glory that you have given me because you loved me before the foundation of the world."
  },
  {
    "text": "Where did Jesus go with his disciples after the Last Supper and prayer, where he was arrested?",
    "options": ["The Temple", "Bethany", "Across the Kidron Valley to a garden (Gethsemane)", "The Mount of Olives summit"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 18:1",
    "verseText": "When Jesus had spoken these words, he went out with his disciples across the Kidron Valley, where there was a garden, which he and his disciples entered."
  },
  {
    "text": "Who accompanied the soldiers and officers from the chief priests and Pharisees to arrest Jesus?",
    "options": ["Pilate", "Nicodemus", "Judas, the betrayer", "Mary Magdalene"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 18:2-3",
    "verseText": "Now Judas, who betrayed him, also knew the place, for Jesus often met there with his disciples. So Judas, having procured a band of soldiers and some officers from the chief priests and the Pharisees, went there with lanterns and torches and weapons."
  },
  {
    "text": "During Peter's first denial in the high priest's courtyard, who questioned him?",
    "options": ["The high priest", "A soldier", "A servant girl", "Judas"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 18:16-17",
    "verseText": "but Peter stood outside at the door. So the other disciple, who was known to the high priest, went out and spoke to the servant girl who kept watch at the door, and brought Peter in. The servant girl at the door said to Peter, “You also are not one of this man's disciples, are you?” He said, “I am not.”"
  },
  {
    "text": "What did Annas primarily ask Jesus about during his questioning?",
    "options": ["His miracles", "His disciples and his teaching", "His plans to overthrow Rome", "His family"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 18:19",
    "verseText": "The high priest then questioned Jesus about his disciples and his teaching."
  },
  {
    "text": "How did Jesus respond when Annas questioned him about his teaching?",
    "options": ["He refused to answer", "He said he taught secretly", "He said he spoke openly to the world and told Annas to ask those who heard him", "He performed a sign"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 18:20-21",
    "verseText": "Jesus answered him, “I have spoken openly to the world. I have always taught in synagogues and in the temple, where all Jews come together. I have said nothing in secret. Why do you ask me? Ask those who have heard me what I said to them; they know what I said.”"
  },
  {
    "text": "After being questioned by Annas, where was Jesus sent next?",
    "options": ["To Herod", "To Caiaphas, the high priest", "Directly to Pilate", "Back to the garden"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 18:24",
    "verseText": "Annas then sent him bound to Caiaphas the high priest."
  },
  {
    "text": "During Peter's subsequent denials, what detail connected one accuser to the arrest scene?",
    "options": ["He recognized Peter's accent", "He was a relative of the man whose ear Peter had cut off", "He saw Peter with Jesus earlier", "He heard Peter call Jesus 'Lord'"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 18:26",
    "verseText": "One of the servants of the high priest, a relative of the man whose ear Peter had cut off, asked, “Did I not see you in the garden with him?”"
  },
  {
    "text": "Why did the Jewish leaders not enter Pilate's headquarters?",
    "options": ["They were afraid of Pilate", "Pilate refused to see them", "To avoid ceremonial defilement so they could eat the Passover", "It was too early in the morning"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 18:28",
    "verseText": "Then they led Jesus from the house of Caiaphas to the governor's headquarters. It was early morning. They themselves did not enter the governor's headquarters, so that they would not be defiled, but could eat the Passover."
  },
  {
    "text": "When Pilate asked the Jewish leaders what accusation they brought against Jesus, what was their initial evasive response?",
    "options": ["'He claims to be a king.'", "'He breaks the Sabbath.'", "'If this man were not a criminal, we would not have handed him over to you.'", "'He blasphemes.'"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 18:29-30",
    "verseText": "So Pilate went outside to them and said, “What accusation do you bring against this man?” They answered him, “If this man were not a criminal, we would not have handed him over to you.”"
  },
  {
    "text": "What custom did Pilate mention that involved releasing a prisoner at Passover?",
    "options": ["Releasing a political prisoner", "Releasing the longest-serving prisoner", "Releasing one prisoner chosen by the crowd", "Releasing a prisoner who paid a ransom"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 18:39",
    "verseText": "But you have a custom that I should release one man for you at the Passover. So do you want me to release to you the King of the Jews?”"
  },
  {
    "text": "Whom did the crowd ask Pilate to release instead of Jesus?",
    "options": ["A tax collector", "A Zealot", "Barabbas, a robber", "Another prophet"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 18:40",
    "verseText": "They cried out again, “Not this man, but Barabbas!” Now Barabbas was a robber."
  },
  {
    "text": "What did the soldiers do to Jesus after Pilate had him flogged?",
    "options": ["Offered him water", "Let him go", "Twisted together a crown of thorns, put it on him, clothed him in a purple robe, and mocked him", "Took him immediately to be crucified"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 19:1-3",
    "verseText": "Then Pilate took Jesus and flogged him. And the soldiers twisted together a crown of thorns and put it on his head and arrayed him in a purple robe. They came up to him, saying, “Hail, King of the Jews!” and struck him with their hands."
  },
  {
    "text": "What did Pilate say when he brought the scourged and mocked Jesus out to the crowd?",
    "options": ["'Crucify him!'", "'He is innocent.'", "'Behold the man!' (Ecce Homo)", "'What is truth?'"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 19:4-5",
    "verseText": "Pilate went out again and said to them, “See, I am bringing him out to you that you may know that I find no guilt in him.” So Jesus came out, wearing the crown of thorns and the purple robe. Pilate said to them, “Behold the man!”"
  },
  {
    "text": "What specific accusation did the Jewish leaders finally level against Jesus before Pilate, based on their law?",
    "options": ["Sedition", "Robbery", "'We have a law, and according to that law he ought to die because he has made himself the Son of God.'", "Tax evasion"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 19:7",
    "verseText": "The Jews answered him, “We have a law, and according to that law he ought to die because he has made himself the Son of God.”"
  },
  {
    "text": "When Pilate emphasized his authority to release or crucify Jesus, what did Jesus say about Pilate's authority?",
    "options": ["Pilate had no real authority", "'You would have no authority over me at all unless it had been given you from above.'", "His authority came from Caesar", "His authority was limited"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 19:10-11",
    "verseText": "So Pilate said to him, “You will not speak to me? Do you not know that I have authority to release you and authority to crucify you?” Jesus answered him, “You would have no authority over me at all unless it had been given you from above. Therefore he who delivered me over to you has the greater sin.”"
  },
  {
    "text": "What was the name of the place where Jesus was crucified, also called the Place of a Skull?",
    "options": ["Gethsemane", "Mount of Olives", "Golgotha", "Kidron Valley"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 19:17",
    "verseText": "and he went out, bearing his own cross, to the place called The Place of a Skull, which in Aramaic is called Golgotha."
  },
  {
    "text": "What inscription did Pilate write and put on the cross?",
    "options": ["'Jesus Christ, Son of God'", "'King of Kings'", "'Jesus of Nazareth, the King of the Jews'", "'Criminal'"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 19:19",
    "verseText": "Pilate also wrote an inscription and put it on the cross. It read, “Jesus of Nazareth, the King of the Jews.”"
  },
  {
    "text": "In what languages was the inscription on the cross written?",
    "options": ["Greek, Latin, and Aramaic (Hebrew)", "Greek and Latin", "Latin and Aramaic", "Greek and Aramaic"],
    "correctAnswerIndex": 0,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 19:20",
    "verseText": "Many of the Jews read this inscription, for the place where Jesus was crucified was near the city, and it was written in Aramaic, in Latin, and in Greek."
  },
  {
    "text": "What did the soldiers do with Jesus' garments after the crucifixion?",
    "options": ["Burned them", "Gave them to Mary", "Divided them into four parts, one for each soldier, and cast lots for his tunic", "Buried them"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 19:23-24",
    "verseText": "When the soldiers had crucified Jesus, they took his garments and divided them into four parts, one part for each soldier; also his tunic. But the tunic was seamless, woven in one piece from top to bottom, so they said to one another, “Let us not tear it, but cast lots for it to see whose it shall be.”"
  },
  {
    "text": "Which women stood near the cross of Jesus, according to John's account?",
    "options": ["Mary Magdalene and Salome", "His mother, his mother's sister, Mary the wife of Clopas, and Mary Magdalene", "Martha and Mary of Bethany", "Only his mother"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 19:25",
    "verseText": "but standing by the cross of Jesus were his mother and his mother's sister, Mary the wife of Clopas, and Mary Magdalene."
  },
  {
    "text": "Knowing that all was finished, what did Jesus say to fulfill Scripture?",
    "options": ["'Father, forgive them'", "'It is finished'", "'I thirst.'", "'Into your hands I commit my spirit'"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 19:28",
    "verseText": "After this, Jesus, knowing that all was now finished, said (to fulfill the Scripture), “I thirst.”"
  },
  {
    "text": "What did the soldiers offer Jesus when he said he was thirsty?",
    "options": ["Water", "Wine", "Sour wine (vinegar) on a hyssop branch", "Nothing"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 19:29",
    "verseText": "A jar full of sour wine stood there, so they put a sponge full of the sour wine on a hyssop branch and held it to his mouth."
  },
  {
    "text": "Besides piercing Jesus' side, what else did a soldier do?",
    "options": ["Broke his legs", "Took his tunic", "Nothing, they just confirmed he was dead", "(John mentions only the piercing, not breaking legs, and the spear thrust itself)"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 19:34",
    "verseText": "But one of the soldiers pierced his side with a spear, and at once there came out blood and water."
  },
  {
    "text": "What flowed out when the soldier pierced Jesus' side?",
    "options": ["Only blood", "Only water", "Blood and water", "Nothing"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 19:34",
    "verseText": "But one of the soldiers pierced his side with a spear, and at once there came out blood and water."
  },
  {
    "text": "Which two individuals, previously secret disciples, asked Pilate for Jesus' body and buried him?",
    "options": ["Peter and John", "Nicodemus and Joseph of Arimathea", "Andrew and Philip", "James and Matthew"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 19:38-39",
    "verseText": "After these things Joseph of Arimathea, who was a disciple of Jesus, but secretly for fear of the Jews, asked Pilate that he might take away the body of Jesus... Nicodemus also, who earlier had come to Jesus by night, came bringing a mixture of myrrh and aloes, about seventy-five pounds in weight."
  },
  {
    "text": "How did Joseph and Nicodemus prepare Jesus' body for burial?",
    "options": ["Washed it and placed it in a shroud", "Bound it in linen cloths with spices, according to Jewish burial customs", "Anointed it with oil", "Placed it directly in the tomb"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 19:40",
    "verseText": "So they took the body of Jesus and bound it in linen cloths with the spices, as is the burial custom of the Jews."
  },
  {
    "text": "Where was the tomb located in which Jesus was buried?",
    "options": ["On a hillside far from the city", "In a public cemetery", "In a garden near the place of crucifixion", "Inside the city walls"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 19:41",
    "verseText": "Now in the place where he was crucified there was a garden, and in the garden a new tomb in which no one had yet been laid."
  },
  {
    "text": "Who ran to the tomb after Mary Magdalene reported it was empty?",
    "options": ["Only Peter", "Only John", "Peter and the other disciple (John)", "Mary Magdalene and the other Mary"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 20:2-4",
    "verseText": "So she ran and went to Simon Peter and the other disciple, the one whom Jesus loved, and said to them, “They have taken the Lord out of the tomb, and we do not know where they have laid him.” So Peter went out with the other disciple, and they were going toward the tomb... Both of them were running together, but the other disciple outran Peter and reached the tomb first."
  },
  {
    "text": "What did the disciples see inside the empty tomb?",
    "options": ["Angels", "The stone rolled away", "The linen cloths lying there, and the face cloth folded up separately", "Jesus' body"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 20:5-7",
    "verseText": "And stooping to look in, he saw the linen cloths lying there, but he did not go in. Then Simon Peter came, following him, and went into the tomb. He saw the linen cloths lying there, and the face cloth, which had been on Jesus' head, not lying with the linen cloths but folded up in a place by itself."
  },
  {
    "text": "What was the reaction of the 'disciple whom Jesus loved' upon seeing the empty tomb and grave clothes?",
    "options": ["He was confused", "He wept", "He saw and believed", "He ran to tell the others"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 20:8",
    "verseText": "Then the other disciple, who had reached the tomb first, also went in, and he saw and believed;"
  },
  {
    "text": "Who did Mary Magdalene initially think Jesus was when she saw him outside the tomb?",
    "options": ["An angel", "Peter", "The gardener", "A Roman soldier"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 20:14-15",
    "verseText": "Having said this, she turned around and saw Jesus standing, but she did not know that it was Jesus. Jesus said to her, “Woman, why are you weeping? Whom are you seeking?” Supposing him to be the gardener, she said to him, “Sir, if you have carried him away, tell me where you have laid him, and I will take him away.”"
  },
  {
    "text": "What did Jesus instruct Mary Magdalene to tell the disciples?",
    "options": ["To meet him in Galilee", "'I am ascending to my Father and your Father, to my God and your God.'", "That he had risen", "To wait in Jerusalem"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 20:17",
    "verseText": "Jesus said to her, “Do not cling to me, for I have not yet ascended to the Father; but go to my brothers and say to them, ‘I am ascending to my Father and your Father, to my God and your God.’”"
  },
  {
    "text": "When Jesus appeared to the disciples behind locked doors, what did he give them authority to do?",
    "options": ["Perform miracles", "Teach all nations", "Forgive sins", "Judge the world"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 20:22-23",
    "verseText": "And when he had said this, he breathed on them and said to them, “Receive the Holy Spirit. If you forgive the sins of any, they are forgiven them; if you withhold forgiveness from any, it is withheld.”"
  },
  {
    "text": "How long after the first appearance to the disciples did Jesus appear when Thomas was present?",
    "options": ["The next day", "Three days later", "Eight days later", "Forty days later"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 20:26",
    "verseText": "Eight days later, his disciples were inside again, and Thomas was with them. Although the doors were locked, Jesus came and stood among them and said, “Peace be with you.”"
  },
  {
    "text": "Besides Peter, Thomas, Nathanael, and the sons of Zebedee (James and John), how many other disciples were present during the appearance by the Sea of Tiberias?",
    "options": ["One", "Two", "Three", "None"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Hard",
    "verseReference": "John 21:2",
    "verseText": "Simon Peter, Thomas (called the Twin), Nathanael of Cana in Galilee, the sons of Zebedee, and two others of his disciples were together."
  },
  {
    "text": "Who first recognized Jesus standing on the shore after the miraculous catch of fish?",
    "options": ["Peter", "Thomas", "The disciple whom Jesus loved (John)", "Nathanael"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 21:7",
    "verseText": "That disciple whom Jesus loved therefore said to Peter, “It is the Lord!” When Simon Peter heard that it was the Lord, he put on his outer garment, for he was stripped for work, and threw himself into the sea."
  },
  {
    "text": "What did Jesus already have prepared for the disciples when they came ashore?",
    "options": ["Nets", "A boat", "A charcoal fire with fish and bread", "Instructions"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 21:9",
    "verseText": "When they got out on land, they saw a charcoal fire in place, with fish laid out on it, and bread."
  },
  {
    "text": "The repeated questioning of Peter's love is often seen as a restoration corresponding to what previous event?",
    "options": ["His confession at Caesarea Philippi", "His walking on water", "His three denials", "His cutting off the servant's ear"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 18:17, 25, 27; 21:15-17",
    "verseText": "(The three questions about love mirror the three times Peter denied Jesus during the trial)."
  },
  {
    "text": "When Peter asked about the fate of the disciple whom Jesus loved, what was Jesus' response?",
    "options": ["He would also be martyred", "He would live forever", "'If it is my will that he remain until I come, what is that to you? You follow me!'", "He would write many books"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 21:21-22",
    "verseText": "When Peter saw him, he said to Jesus, “Lord, what about this man?” Jesus said to him, “If it is my will that he remain until I come, what is that to you? You follow me!”"
  },
  {
    "text": "What misunderstanding arose among the brothers concerning the disciple whom Jesus loved?",
    "options": ["That he was greater than Peter", "That he would betray Jesus", "That he would not die", "That he would be the first Pope"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 21:23",
    "verseText": "So the saying spread abroad among the brothers that this disciple was not to die; yet Jesus did not say to him that he was not to die, but, “If it is my will that he remain until I come, what is that to you?”"
  },
  {
    "text": "How does the author conclude the Gospel, regarding the things Jesus did?",
    "options": ["He listed everything important", "He admitted some things were forgotten", "There are also many other things that Jesus did; were every one of them to be written, the world itself could not contain the books", "He focused only on the miracles"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 21:25",
    "verseText": "Now there are also many other things that Jesus did. Were every one of them to be written, I suppose that the world itself could not contain the books that would be written."
  },
  {
    "text": "Throughout John's Gospel, Jesus' miracles are referred to by what term?",
    "options": ["Wonders", "Powers", "Signs", "Marvels"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 2:11, 4:54, 20:30",
    "verseText": "This, the first of his signs, Jesus did at Cana... This was now the second sign... Now Jesus did many other signs in the presence of the disciples..."
  },
  {
    "text": "What key theological concept, contrasted with darkness, is repeatedly emphasized in John's prologue and Jesus' teachings?",
    "options": ["Wisdom", "Power", "Light", "Law"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 1:4-5, 8:12",
    "verseText": "In him was life, and the life was the light of men. The light shines in the darkness, and the darkness has not overcome it... Again Jesus spoke to them, saying, “I am the light of the world."
  },
  {
    "text": "Which Jewish feast provides the backdrop for Jesus' 'Bread of Life' discourse?",
    "options": ["Feast of Tabernacles", "Passover", "Pentecost", "Feast of Dedication (Hanukkah)"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 6:4",
    "verseText": "Now the Passover, the feast of the Jews, was at hand."
  },
  {
    "text": "Which Jewish feast provides the backdrop for Jesus' teaching about 'living water' and his claim 'I am the light of the world'?",
    "options": ["Passover", "Feast of Tabernacles", "Pentecost", "Day of Atonement"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Hard",
    "verseReference": "John 7:2, 37-38; 8:12",
    "verseText": "Now the Jews' Feast of Tabernacles was at hand... On the last day of the feast... Jesus stood up and cried out, “If anyone thirsts, let him come to me and drink... Again Jesus spoke to them, saying, “I am the light of the world.” (Tabernacles involved water-drawing and light ceremonies)."
  },
  {
    "text": "Which Jewish feast provides the backdrop for Jesus' 'Good Shepherd' discourse?",
    "options": ["Passover", "Feast of Tabernacles", "Feast of Dedication (Hanukkah)", "Purim"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Hard",
    "verseReference": "John 10:22-24",
    "verseText": "At that time the Feast of Dedication took place at Jerusalem. It was winter, and Jesus was walking in the temple, in the colonnade of Solomon. So the Jews gathered around him and said to him, “How long will you keep us in suspense? If you are the Christ, tell us plainly.” (Jesus responds with shepherd imagery)."
  },
  {
    "text": "What does Jesus identify as the 'work of God' that people should do?",
    "options": ["Follow the Law perfectly", "Perform miracles", "Believe in him whom God has sent", "Give to the poor"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 6:28-29",
    "verseText": "Then they said to him, “What must we do, to be doing the works of God?” Jesus answered them, “This is the work of God, that you believe in him whom he has sent.”"
  },
  {
    "text": "Jesus contrasts himself with the 'thief' whose purpose is to do what?",
    "options": ["Lead the sheep astray", "Steal and kill and destroy", "Care for the sheep poorly", "Lock the sheep gate"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 10:10",
    "verseText": "The thief comes only to steal and kill and destroy. I came that they may have life and have it abundantly."
  },
  {
    "text": "What did Jesus promise would happen for those who believe in him, even if they die?",
    "options": ["They would be remembered", "They would live", "Their names would be written in heaven", "Their families would be blessed"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 11:25-26",
    "verseText": "Jesus said to her, “I am the resurrection and the life. Whoever believes in me, though he die, yet shall he live, and everyone who lives and believes in me shall never die. Do you believe this?”"
  },
  {
    "text": "What concept, meaning 'glory' or 'honor,' is central to Jesus' understanding of his mission and death in John?",
    "options": ["Power (Dynamis)", "Truth (Aletheia)", "Glory (Doxa)", "Life (Zoe)"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Medium",
    "verseReference": "John 12:23, 17:1, 5",
    "verseText": "And Jesus answered them, “The hour has come for the Son of Man to be glorified.”... When Jesus had spoken these words, he lifted up his eyes to heaven, and said, “Father, the hour has come; glorify your Son that the Son may glorify you... And now, Father, glorify me..."
  },
  {
    "text": "How did Jesus describe the relationship between himself and the Father?",
    "options": ["As separate beings with different goals", "'I and the Father are one.'", "As master and servant", "As teacher and student"],
    "correctAnswerIndex": 1,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 10:30",
    "verseText": "I and the Father are one.”"
  },
  {
    "text": "What does Jesus say will be the identifying mark of his disciples to the world?",
    "options": ["Their knowledge of scripture", "Their ability to perform signs", "Their love for one another", "Their separation from the world"],
    "correctAnswerIndex": 2,
    "book": "John",
    "difficulty": "Easy",
    "verseReference": "John 13:35",
    "verseText": "By this all people will know that you are my disciples, if you have love for one another.”"
  }
]
