[
  {
    "text": "Zechariah prophesied alongside which other prophet during the rebuilding of the Temple?",
    "options": ["Isaiah", "Jeremiah", "Haggai", "Malachi"],
    "correctAnswerIndex": 2,
    "book": "Zechariah",
    "difficulty": "Easy",
    "verseReference": "Ezra 5:1",
    "verseText": "Now the prophets, Haggai and Zechariah the son of Iddo, prophesied to the Jews who were in Judah and Jerusalem, in the name of the God of Israel who was over them."
  },
  {
    "text": "Zechariah's ministry began in the second year of which Persian king?",
    "options": ["Cyrus", "Darius", "Artaxerxes", "Xerxes"],
    "correctAnswerIndex": 1,
    "book": "Zechariah",
    "difficulty": "Easy",
    "verseReference": "Zechariah 1:1",
    "verseText": "In the eighth month, in the second year of Darius, the word of the LORD came to the prophet Zechariah, the son of Berechiah, son of Iddo..."
  },
  {
    "text": "Zechariah chapters 1-8 primarily consist of a series of what?",
    "options": ["Historical narratives", "Laws and regulations", "Eight night visions", "Songs of praise"],
    "correctAnswerIndex": 2,
    "book": "Zechariah",
    "difficulty": "Medium",
    "verseReference": "Zechariah 1:7-6:8",
    "verseText": "(Chapters 1-6 describe a series of eight symbolic visions Zechariah received in one night)."
  },
  {
    "text": "In Zechariah's first vision, what did the horsemen among the myrtle trees report?",
    "options": ["The whole earth was at peace and rest", "War was breaking out everywhere", "The Temple was finished", "The king was angry"],
    "correctAnswerIndex": 0,
    "book": "Zechariah",
    "difficulty": "Medium",
    "verseReference": "Zechariah 1:11",
    "verseText": "And they answered the angel of the LORD who was standing among the myrtle trees, ‘We have patrolled the earth, and behold, all the earth remains at rest.’”"
  },
  {
    "text": "What did the vision of the four horns and four craftsmen represent (Zechariah 1:18-21)?",
    "options": ["Four seasons and four elements", "Four empires that scattered Judah and the powers that would overthrow them", "Four corners of the earth and God's messengers", "Four types of sacrifices and the priests"],
    "correctAnswerIndex": 1,
    "book": "Zechariah",
    "difficulty": "Hard",
    "verseReference": "Zechariah 1:19, 21",
    "verseText": "And I said to the angel... ‘What are these?’ And he said to me, ‘These are the horns that scattered Judah...’ Then the LORD showed me four craftsmen... ‘These have come to terrify them, to cast down the horns of the nations who lifted up their horn against the land of Judah to scatter it.’”"
  },
  {
    "text": "In the vision of Joshua the High Priest (Zechariah 3), who stood accusing him?",
    "options": ["An angel", "Moses", "Satan", "The people"],
    "correctAnswerIndex": 2,
    "book": "Zechariah",
    "difficulty": "Medium",
    "verseReference": "Zechariah 3:1",
    "verseText": "Then he showed me Joshua the high priest standing before the angel of the LORD, and Satan standing at his right hand to accuse him."
  },
  {
    "text": "What was done for Joshua the High Priest in the vision to symbolize cleansing and restoration?",
    "options": ["He was given new clothes", "He was anointed with oil", "He was washed with water", "He offered a sacrifice"],
    "correctAnswerIndex": 0,
    "book": "Zechariah",
    "difficulty": "Medium",
    "verseReference": "Zechariah 3:4-5",
    "verseText": "And the angel said to those who were standing before him, “Remove the filthy garments from him.” And to him he said, “Behold, I have taken your iniquity away from you, and I will clothe you with pure vestments.” And I said, “Let them put a clean turban on his head.” So they put a clean turban on his head and clothed him with garments."
  },
  {
    "text": "The vision of the golden lampstand and two olive trees (Zechariah 4) primarily encouraged whom?",
    "options": ["The priests", "Zerubbabel, assuring him the Temple would be finished by God's Spirit", "The returning exiles", "The Persian king"],
    "correctAnswerIndex": 1,
    "book": "Zechariah",
    "difficulty": "Medium",
    "verseReference": "Zechariah 4:6, 9",
    "verseText": "Then he said to me, “This is the word of the LORD to Zerubbabel: Not by might, nor by power, but by my Spirit, says the LORD of hosts... The hands of Zerubbabel have laid the foundation of this house; his hands shall also complete it."
  },
  {
    "text": "Zechariah 9:9 famously prophesies about Jerusalem's king coming in what manner?",
    "options": ["Riding on a warhorse", "In a chariot of fire", "Humble and mounted on a donkey", "With a host of angels"],
    "correctAnswerIndex": 2,
    "book": "Zechariah",
    "difficulty": "Easy",
    "verseReference": "Zechariah 9:9",
    "verseText": "Rejoice greatly, O daughter of Zion! Shout aloud, O daughter of Jerusalem! Behold, your king is coming to you; righteous and having salvation is he, humble and mounted on a donkey, on a colt, the foal of a donkey."
  },
  {
    "text": "What price is Zechariah symbolically paid for his shepherding, which he then throws into the Temple treasury (Zechariah 11:12-13)?",
    "options": ["Ten pieces of gold", "Thirty pieces of silver", "One hundred talents", "A field"],
    "correctAnswerIndex": 1,
    "book": "Zechariah",
    "difficulty": "Hard",
    "verseReference": "Zechariah 11:12-13",
    "verseText": "Then I said to them, “If it seems good to you, give me my wages; but if not, keep them.” And they weighed out as my wages thirty pieces of silver. Then the LORD said to me, “Throw it to the potter”—the lordly price at which I was priced by them! So I took the thirty pieces of silver and threw them into the house of the LORD, to the potter."
  }
]
