[
  {
    "text": "Zephaniah prophesied during the reign of which reforming king of Judah?",
    "options": ["Hezekiah", "Manasseh", "Josiah", "Ahaz"],
    "correctAnswerIndex": 2,
    "book": "Zephaniah",
    "difficulty": "Medium",
    "verseReference": "Zephaniah 1:1",
    "verseText": "The word of the LORD that came to Zephaniah the son of Cushi, son of Gedaliah, son of Amariah, son of Hezekiah, in the days of Josiah the son of Amon, king of Judah."
  },
  {
    "text": "A major theme throughout Zephaniah is the coming...",
    "options": ["Era of peace", "Day of the LORD", "Rebuilding of the Temple", "Conquest of Egypt"],
    "correctAnswerIndex": 1,
    "book": "Zephaniah",
    "difficulty": "Easy",
    "verseReference": "Zephaniah 1:7, 14",
    "verseText": "Be silent before the Lord GOD! For the day of the LORD is near... The great day of the LORD is near, near and hastening fast;"
  },
  {
    "text": "How is the Day of the LORD described in Zephaniah 1:15?",
    "options": ["A day of joy and feasting", "A day of wrath, distress, anguish, ruin, devastation, darkness, gloom", "A day of building and planting", "A day of rest and peace"],
    "correctAnswerIndex": 1,
    "book": "Zephaniah",
    "difficulty": "Easy",
    "verseReference": "Zephaniah 1:15",
    "verseText": "A day of wrath is that day, a day of distress and anguish, a day of ruin and devastation, a day of darkness and gloom, a day of clouds and thick darkness,"
  },
  {
    "text": "Zephaniah condemns Judah for adopting the idolatrous practices of whom?",
    "options": ["Egypt", "Babylon", "The surrounding nations (Baal, Molech, astral worship)", "Greece"],
    "correctAnswerIndex": 2,
    "book": "Zephaniah",
    "difficulty": "Medium",
    "verseReference": "Zephaniah 1:4-6",
    "verseText": "I will stretch out my hand against Judah... those who bow down on the roofs to the host of the heavens; those who bow down and swear to the LORD and yet swear by Milcom (Molech)..."
  },
  {
    "text": "Besides Judah, Zephaniah also pronounces judgment on which surrounding nations/cities?",
    "options": ["Rome and Athens", "Philistia (Gaza, Ashkelon), Moab, Ammon, Cush (Ethiopia), Assyria (Nineveh)", "Persia and Media", "Only Judah"],
    "correctAnswerIndex": 1,
    "book": "Zephaniah",
    "difficulty": "Medium",
    "verseReference": "Zephaniah 2:4-15",
    "verseText": "(Prophecies against Philistine cities, Moab, Ammon, Cush, and Assyria/Nineveh)"
  },
  {
    "text": "What is the call to the 'humble of the land' in Zephaniah 2:3?",
    "options": ["Flee to Egypt", "Prepare for war", "Seek the LORD, seek righteousness, seek humility; perhaps you may be hidden", "Build fortifications"],
    "correctAnswerIndex": 2,
    "book": "Zephaniah",
    "difficulty": "Easy",
    "verseReference": "Zephaniah 2:3",
    "verseText": "Seek the LORD, all you humble of the land, who do his just commands; seek righteousness; seek humility; perhaps you may be hidden on the day of the anger of the LORD."
  },
  {
    "text": "Zephaniah 3 condemns the officials, judges, prophets, and priests of which city?",
    "options": ["Nineveh", "Babylon", "Jerusalem", "Samaria"],
    "correctAnswerIndex": 2,
    "book": "Zephaniah",
    "difficulty": "Medium",
    "verseReference": "Zephaniah 3:1-4",
    "verseText": "Woe to her who is rebellious and defiled, the oppressing city! ... Her officials within her are roaring lions; her judges are evening wolves... Her prophets are fickle, treacherous men; her priests profane what is holy; they do violence to the law."
  },
  {
    "text": "Despite the judgment, Zephaniah 3 promises a future restoration including the purification of what for the nations?",
    "options": ["Their armies", "Their wealth", "Their lips (speech)", "Their temples"],
    "correctAnswerIndex": 2,
    "book": "Zephaniah",
    "difficulty": "Medium",
    "verseReference": "Zephaniah 3:9",
    "verseText": "“For at that time I will change the speech of the peoples to a pure speech, that all of them may call upon the name of the LORD and serve him with one accord."
  },
  {
    "text": "How is God pictured in the midst of His restored people in Zephaniah 3:17?",
    "options": ["As a distant observer", "As a harsh judge", "As a mighty warrior who saves, rejoices over them with gladness, quiets them with love, exults over them with singing", "As a king demanding tribute"],
    "correctAnswerIndex": 2,
    "book": "Zephaniah",
    "difficulty": "Easy",
    "verseReference": "Zephaniah 3:17",
    "verseText": "The LORD your God is in your midst, a mighty one who will save; he will rejoice over you with gladness; he will quiet you by his love; he will exult over you with loud singing."
  },
  {
    "text": "What will God remove from His people according to Zephaniah 3:11-12?",
    "options": ["Their wealth", "Their land", "Their pride and haughtiness, leaving a people humble and lowly", "Their enemies"],
    "correctAnswerIndex": 2,
    "book": "Zephaniah",
    "difficulty": "Medium",
    "verseReference": "Zephaniah 3:11-12",
    "verseText": "On that day you shall not be put to shame because of the deeds by which you have rebelled against me; for then I will remove from your midst your proudly exultant ones... But I will leave in your midst a people humble and lowly."
  }
]
